# 3.6.1. Набор данных с ценами на жилье в Бостоне
# Мы попытаемся предсказать медианную цену на дома в пригороде Бостона в середине 1970-х по таким данным о пригороде того времени, как уровень преступности, ставка местного имущественного налога и т. д. Набор данных, который нам предстоит использовать, имеет интересное отличие от двух предыдущих примеров. Он содержит относительно немного образцов данных: всего 506, разбитых на 404 обучающих и 102 контрольных образца. И каждый признак во входных данных (например, уровень преступности) имеет свой масштаб. Например, некоторые признаки являются пропорциями и имеют значения между 0 и 1, другие — между 1 и 12 и т. д.

# Листинг 3.24. Загрузка набора данных для Бостона



from keras.datasets import boston_housing

(train_data, train_targets), (test_data, test_targets) = boston_housing.load_data()


# Посмотрим на данные:
    
    
# >>> train_data.shape
# (404, 13)
# >>> test_data.shape
# (102, 13)

#  Глава 3 • Начало работы с нейронными сетями
# Как видите, у нас имеются 404 обучающих и 102 контрольных образца, каждый с 13 числовыми признаками, такими как уровень преступности, среднее число комнат в доме, удаленность от центральных дорог и т. д.
# Цели — медианные значения цен на дома, занимаемые собственниками, в тысячах долларов:


# >>> train_targets
# [ 15.2, 42.3, 50. ... 19.4, 19.4, 29.1]


# 3.6.2. Подготовка данных
# Было бы проблематично передать в нейронную сеть значения, имеющие самые разные диапазоны. Сеть, конечно, сможет автоматически адаптироваться к таким разнородным данным, однако это усложнит обучение. На практике к таким данным принято применять нормализацию: для каждого признака во входных данных (столбца в матрице входных данных) из каждого значения вычитается среднее по этому признаку, и разность делится на стандартное отклонение, в результате признак центрируется по нулевому значению и имеет стандартное отклонение, равное единице. Такую нормализацию легко выполнить с помощью Numpy.

# Листинг 3.25. Нормализация данных

mean = train_data.mean(axis=0)
train_data -= mean
std = train_data.std(axis=0)
train_data /= std
test_data -= mean
test_data /= std

# Обратите внимание на то, что величины, используемые для нормализации контрольных данных, вычисляются с использованием обучающих данных. Никогда не следует использовать в работе какие-либо значения, вычисленные по контрольным данным, даже для таких простых шагов, как нормализация данных.


# 3.6.3. Конструирование сети
# Из-за небольшого количества образцов мы будем использовать очень маленькую сеть с двумя четырехмерными промежуточными слоями. Вообще говоря, чем меньше обучающих данных, тем скорее наступит переобучение, а использование маленькой сети — один из способов борьбы с ним.


# Листинг 3.26. Определение модели

from keras import models
from keras import layers



def build_model():
    model = models.Sequential() #Поскольку нам потребуется несколько экземпляров одной и той же модели, мы определили функцию для ее создания
    model.add(layers.Dense(64, activation='relu',input_shape=(train_data.shape[1],)))
    model.add(layers.Dense(64, activation='relu'))
    model.add(layers.Dense(1))
    
    model.compile(optimizer='rmsprop', loss='mse', metrics=['mae'])
    return model


# Сеть заканчивается одномерным слоем, не имеющим функции активации (это линейный слой). Это типичная конфигурация для скалярной регрессии (целью которой является предсказание одного значения на непрерывной числовой прямой). Применение функции активации могло бы ограничить диапазон выходных значений: например, если в последнем слое применить функцию активации sigmoid, сеть обучилась бы предсказывать только значения из диапазона между 0 и 1. В данном случае, с линейным последним слоем, сеть способна предсказывать значения из любого диапазона.

# Обратите внимание на то, что сеть компилируется с функцией потерь mse — mean squared error (среднеквадратичная ошибка), вычисляющей квадрат разности между предсказанными и целевыми значениями. Эта функция широко используется в задачах регрессии.

# Мы также включили новый параметр в мониторинг на этапе обучения: mae — mean absolute error (средняя абсолютная ошибка). Это абсолютное значение разности между предсказанными и целевыми значениями. Например, значение MAE, равное 0,5, в этой задаче означает, что в среднем прогнозы отклоняются на 500 долларов США.


# 3.6.4. Оценка решения методом перекрестной проверки по K блокам
# Чтобы оценить качество сети в ходе корректировки ее параметров (таких, как количество эпох обучения), можно разбить исходные данные на обучающий и проверочный наборы, как это делалось в предыдущих примерах. Однако так как у нас и без того небольшой набор данных, проверочный набор получился бы слишком маленьким (скажем, что-нибудь около 100 образцов). Как следствие, оценки при проверке могут сильно меняться в зависимости от того, какие данные попадут в проверочный и обучающий наборы: оценки при проверке могут иметь слишком большой разброс. Это не позволит надежно оценить качество модели.

# Лучшей практикой в таких ситуациях является применение перекрестной проверки по K блокам (K-fold cross-validation), как показано на рис. 3.11. Суть ее заключается в разделении доступных данных на K блоков (обычно K = 4 или 5), создании K идентичных моделей и обучении каждой на K—1 блоках с оценкой по оставшимся блокам. По полученным K оценкам вычисляется среднее значение, которое принимается как оценка модели. В коде такая проверка реализуется достаточно просто.


# Листинг 3.27. Перекрестная проверка по K блокам


import numpy as np

k = 4
num_val_samples = len(train_data) // k

num_epochs = 100

all_scores = []

for i in range(k):
    print('processing fold #', i)
    val_data = train_data[i * num_val_samples: (i + 1) * num_val_samples] #Подготовка проверочных данных: данных из блока с номером k 
    val_targets = train_targets[i * num_val_samples: (i + 1) * num_val_samples]
    
    partial_train_data = np.concatenate( [train_data[:i * num_val_samples], train_data[(i + 1) * num_val_samples:]], axis=0) #Подготовка обучающих данных: данных из остальных блоков
    
    partial_train_targets = np.concatenate( [train_targets[:i * num_val_samples], train_targets[(i + 1) * num_val_samples:]], axis=0)
    
    model = build_model() #Конструирование модели Keras (уже скомпилированной)
    model.fit(partial_train_data, partial_train_targets, epochs=num_epochs, batch_size=1, verbose=0) #Обучение модели (в режиме без вывода сообщений , verbose = 0)
    
    val_mse, val_mae = model.evaluate(val_data, val_targets, verbose=0) #Оценка модели по проверочным данным(val_mse)
    all_scores.append(val_mae)
    
    
    
# val_data = train_data[i * num_val_samples: (i + 1) * num_val_samples]:

# i * num_val_samples: Это определяет начальный индекс среза. Умножение i * num_val_samples позволяет выбрать стартовую позицию данных в train_data для текущего блока (фолда) в k-fold кросс-валидации.

# (i + 1) * num_val_samples: Это определяет конечный индекс среза. Умножение (i + 1) * num_val_samples определяет конечную позицию данных в train_data для текущего блока.

# train_data[i * num_val_samples: (i + 1) * num_val_samples]: Это создает срез (slice) из train_data для текущего блока. Он включает в себя данные, начиная с индекса i * num_val_samples и заканчивая индексом (i + 1) * num_val_samples - 1.

# train_targets[i * num_val_samples: (i + 1) * num_val_samples]: Это создает срез (slice) из train_targets для текущего блока. Он включает в себя целевые значения, начиная с индекса i * num_val_samples и заканчивая индексом (i + 1) * num_val_samples - 1.

# Давайте разберем подробно строку partial_train_data = np.concatenate([train_data[:i * num_val_samples], train_data[(i + 1) * num_val_samples:]], axis=0):

# train_data[:i * num_val_samples]: Эта часть выбирает данные обучения до начала текущего блока (фолда). Оператор среза [:i * num_val_samples] означает выбор данных с самого начала до индекса (i * num_val_samples - 1).

# train_data[(i + 1) * num_val_samples:]: Эта часть выбирает данные обучения после окончания текущего блока (фолда). Оператор среза [(i + 1) * num_val_samples:] означает выбор данных, начиная с индекса ((i + 1) * num_val_samples) и до конца массива.

# np.concatenate([...], axis=0): Это функция NumPy, которая объединяет два массива данных. Здесь она объединяет два среза данных обучения вдоль оси 0 (по вертикали), создавая таким образом один массив данных обучения для текущего блока.

# Итак, partial_train_data представляет собой данные обучения, исключая текущий блок (фолд) в k-fold кросс-валидации. Эта строка позволяет создать обучающий набор данных, который используется для обучения модели, исключая данные для текущего блока валидации.
# >>> all_scores
# [2.266319990158081, 2.59100604057312, 2.769660472869873, 2.5300023555755615]
# >>> np.mean(all_scores)
# 2.539247214794159
# >>>


# >>> all_scores
# [2.588258957792037, 3.1289568449719116, 3.1856116051248984, 3.0763342615401386]
# >>> np.mean(all_scores)
# 2.9947904173572462
# Разные прогоны действительно показывают разные оценки, от 2,6 до 3,2. Средняя (3,0) выглядит более достоверно, чем любая из оценок отдельных прогонов, — в этом главная ценность перекрестной проверки по K блокам. В данном случае средняя ошибка составила 3000 долларов, что довольно много, если вспомнить, что цены колеблются в диапазоне от 10 000 до 50 000 долларов.
# Попробуем увеличить время обучения сети до 500 эпох. Чтобы получить информацию о качестве обучения модели в каждую эпоху, изменим цикл обучения и добавим сохранение оценки проверки перед началом эпохи.



# Листинг 3.28. Сохранение оценки проверки перед каждым прогоном

num_epochs = 500

all_mae_histories = []


for i in range(k):
    print('processing fold #', i)
    val_data = train_data[i * num_val_samples: (i + 1) * num_val_samples] #Подготовка проверочных данных: данных из блока с номером k 
    val_targets = train_targets[i * num_val_samples: (i + 1) * num_val_samples]
    
    partial_train_data = np.concatenate( [train_data[:i * num_val_samples], train_data[(i + 1) * num_val_samples:]], axis=0) #Подготовка обучающих данных: данных из остальных блоков
    partial_train_targets = np.concatenate( [train_targets[:i * num_val_samples], train_targets[(i + 1) * num_val_samples:]], axis=0)
    
    model = build_model() #Конструирование модели Keras (уже скомпилированной)
    
    history = model.fit(partial_train_data, partial_train_targets, validation_data=(val_data, val_targets), epochs=num_epochs, batch_size=1, verbose=0) # Обучение модели (в режиме без вывода сообщений, verbose = 0)
    mae_history = history.history['val_mae']
    all_mae_histories.append(mae_history)



# Да, вы правы, это относится к остальным трем блокам в контексте k-fold кросс-валидации. В этом цикле кода каждый блок (фолд) используется как проверочные данные (validation set), а остальные три блока объединяются в один блок, который служит обучающими данными (training set). Таким образом, "остальные блоки" означают блоки, которые не являются текущим блоком, используемым в качестве проверочных данных.

# В контексте вашего кода, цикл выполняется для каждого из четырех блоков, и в каждой итерации текущий блок служит проверочными данными (val_data, val_targets), а остальные три блока объединяются в обучающие данные (partial_train_data, partial_train_targets). Таким образом, при каждой итерации цикла модель обучается четыре раза (на четырех разных наборах данных), и каждый блок используется в качестве проверочных данных один раз.
# Теперь можно вычислить средние значения метрики mae для всех прогонов.
# Листинг 3.29. Создание истории последовательных средних оценок проверки
# по K блокам

average_mae_history = [np.mean([x[i] for x in all_mae_histories]) for i in range(num_epochs)]


# Листинг 3.30. Формирование графика с оценками проверок

import matplotlib.pyplot as plt

plt.plot(range(1, len(average_mae_history) + 1), average_mae_history)
plt.xlabel('Epochs')
plt.ylabel('Validation MAE')
plt.show()



# Из-за проблем с масштабированием, а также ввиду относительно высокой дисперсии может быть немного затруднительно увидеть общую тенденцию. Давайте сделаем следующее:
# 
# опустим первые 10 замеров, которые имеют другой масштаб, отличный от масштаба остальной кривой;
# 
# заменим каждую оценку экспоненциальным скользящим средним по предыдущим оценкам, чтобы получить более гладкую кривую.
# Результат показан на рис. 3.13.
# Согласно этому графику, наилучшая оценка MAE достигается после 80 эпох. После этого момента начинается переобучение.



# Листинг 3.31. Формирование графика с оценками проверок за исключением
# первых 10 замеров


def smooth_curve(points, factor=0.9):
    smoothed_points = []
    for point in points:
        if smoothed_points:
            previous = smoothed_points[-1]
            smoothed_points.append(previous * factor + point * (1 - factor))
        else:
            smoothed_points.append(point)
    return smoothed_points


smooth_mae_history = smooth_curve(average_mae_history[10:])




plt.plot(range(1, len(smooth_mae_history) + 1), smooth_mae_history)
plt.xlabel('Epochs')
plt.ylabel('Validation MAE')
plt.show()

44/ 80

# По окончании настройки других параметров модели (кроме количества эпох можно также скорректировать количество промежуточных слоев) можно обучить окончательную версию модели на всех обучающих данных, а затем оценить ее качество на контрольных данных.



# Листинг 3.32. Обучение окончательной версии модели

model = build_model()

model.fit(train_data, train_targets, epochs=80, batch_size=16, verbose=0)

test_mse_score, test_mae_score = model.evaluate(test_data, test_targets)

# >>>
# >>> plt.plot(range(1, len(average_mae_history) + 1), average_mae_history)
# [<matplotlib.lines.Line2D object at 0x7fc40e1845e0>]
# >>> plt.xlabel('Epochs')
# Text(0.5, 47.04444444444444, 'Epochs')
# >>> plt.ylabel('Validation MAE')
# Text(67.31944444444443, 0.5, 'Validation MAE')
# >>> plt.plot(range(1, len(smooth_mae_history) + 1), smooth_mae_history)
# [<matplotlib.lines.Line2D object at 0x7fc411717160>]
# >>> plt.xlabel('Epochs')
# Text(0.5, 47.04444444444444, 'Epochs')
# >>> plt.ylabel('Validation MAE')
# Text(85.31944444444443, 0.5, 'Validation MAE')

# Вот окончательный результат:
# >>> test_mae_score
# 2.5532484335057877
# Средняя ошибка все еще составляет около 2550 долларов.


3.6.5. Подведение итогов
Вот какие выводы вы должны сделать из этого примера:

Регрессия выполняется с применением иных функций потерь, нежели классификация. Для регрессии часто используется функция потерь, вычисляющая среднеквадратичную ошибку (Mean Squared Error, MSE).

Аналогично, для регрессии используются иные метрики оценки, нежели при классификации; понятие точности неприменимо для регрессии, поэтому для оценки качества часто применяется средняя абсолютная ошибка (Mean Absolute Error, MAE).

Когда признаки образцов на входе имеют значения из разных диапазонов, их необходимо предварительно масштабировать.

При небольшом объеме входных данных надежно оценить качество модели поможет метод перекрестной проверки по K блокам.

При небольшом объеме обучающих данных предпочтительнее использовать маленькие сети с небольшим количеством промежуточных слоев (обычно с одним или двумя), чтобы избежать серьезного переобучения.


Краткие итоги главы

Теперь вы умеете решать наиболее распространенные задачи машинного обучения на векторных данных: бинарную классификацию, многоклассовую классификацию и скалярную регрессию. В разделах «Подведение итогов» выше в этой главе перечисляются наиболее важные выводы, которые вы должны извлечь из примеров решения этих задач.

Исходные данные обычно приходится подвергать предварительной обработке перед передачей в нейронную сеть.

Когда данные включают в себя признаки со значениями из разных диапазонов, их необходимо предварительно масштабировать.

В процессе обучения нейронных сетей в некоторый момент наступает эффект переобучения, из-за чего падает качество результатов оценки сети на данных, которые она прежде не видела.









