from keras.datasets import imdb
# from keras.utils.np_utils import to_categorical
from keras.utils import to_categorical

from keras import losses
from keras import metrics
from keras import models
from keras import layers
from keras import optimizers
from keras import regularizers
import matplotlib.pyplot as plt
import numpy as np

from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Embedding, Flatten, Dense, Dropout, Conv1D, MaxPooling1D
from tensorflow.keras.datasets import imdb
from tensorflow.keras.preprocessing.sequence import pad_sequences
from tensorflow.keras.preprocessing.image import ImageDataGenerator


(train_data, train_labels), (test_data, test_labels) = imdb.load_data(num_words=10000)

# Аргумент num_words=10000 означает, что в обучающих данных будет сохранено только 10 000 слов,
# наиболее часто встречающихся в обучающем наборе отзывов.

# Переменные train_data и test_data — это списки отзывов; каждый отзыв —
# это список индексов слов (кодированное представление последовательности слов).
# Переменные train_labels и test_labels — это списки нулей и единиц, где нули соответствуют отрицательным отзывам
# , а единицы — положительным:


# Чтобы вам было понятнее, ниже показано декодирование одного из отзывов в последовательность слов на английском языке:

word_index = imdb.get_word_index() # word_index — это словарь, отображающий слова в целочисленные индексы

reverse_word_index = dict( [(value, key) for (key, value) in word_index.items()]) #Получить обратное представление словаря, отображающее индексы в слова


decoded_review = ' '.join( [reverse_word_index.get(i - 3, '?') for i in train_data[0]]) # Декодирование отзыва. Обратите внимание, что индексы смещены на 3, потому что индексы 0, 1 и 2 зарезервированы для слов «padding» (отступ), «start of sequence» (начало последовательности) и «unknown» (неизвестно)


# 3.4.2. Подготовка данных
# Нельзя передать списки целых чисел непосредственно в нейронную сеть. Поэтому мы должны преобразовать их в тензоры. Сделать это можно двумя способами:
# 
# Привести все списки к одинаковой длине, преобразовать их в тензоры целых чисел с формой (образцы, индексы_слов) и затем передать их в первый слой сети, способный обрабатывать такие целочисленные тензоры (слой Embedding, о котором подробнее мы поговорим далее в этой книге).
# 
# Выполнить прямое кодирование списков в векторы нулей и единиц. Это может означать, например, преобразование последовательности [3, 5] в 10 000-мерный вектор, все элементы которого содержат нули, кроме элементов с индексами 3 и 5, которые содержат единицы. Затем их можно передать в первый слой сети типа Dense, способный обрабатывать векторизованные данные с вещественными числами.


# Листинг 3.2. Кодирование последовательностей целых чисел в бинарную матрицу

def vectorize_sequences(sequences, dimension=10000):
    results = np.zeros((len(sequences), dimension))
    for i, sequence in enumerate(sequences):
        results[i, sequence] = 1.                       # Запись единицы в элемент с данным индексом
        return results
    
x_train = vectorize_sequences(train_data) #Векторизованные обучающие данные

x_test = vectorize_sequences(test_data)

# Нам также нужно векторизовать метки, что делается очень просто:
y_train = np.asarray(train_labels).astype('float32')
y_test = np.asarray(test_labels).astype('float32')


# Теперь данные готовы к передаче в нейронную сеть


# 3.4.3. Конструирование сети
# Входные данные представлены векторами, а метки — скалярами (единицами и нулями): это самый простой набор данных, какой можно встретить. С задачами этого вида прекрасно справляются сети, организованные как простой стек полносвязных (Dense) слоев с операцией активации relu: Dense(16, activation='relu').

# Аргумент (16), передаваемый каждому слою Dense, — это число скрытых нейронов слоя. Скрытый нейрон (hidden unit) — это измерение в пространстве представлений слоя. Как рассказывалось в главе 2, каждый слой Dense с операцией активации relu реализует следующую цепочку операций с тензорами:
# output = relu(dot(W, input) + b)
# Наличие 16 скрытых нейронов означает, что весовая матрица W будет иметь форму (input_dimension, 16): скалярное произведение на W спроецирует входные данные в 16-мерное пространство представлений (затем будет произведено сложение с вектором смещений b и выполнена операция relu). Размерность пространства представлений можно интерпретировать как «степень свободы нейронной сети при изучении внутренних представлений». Большее количество скрытых нейронов

# (большая размерность пространства представлений) позволяет сети обучаться на более сложных представлениях, но при этом увеличивается вычислительная стоимость сети, что может привести к выявлению нежелательных шаблонов (шаблонов, которые могут повысить качество классификации обучающих данных, но не контрольных).
# В отношении такого стека слоев Dense требуется принять два важных архитектурных решения:
    
#     
# сколько слоев использовать;
# 
# сколько скрытых нейронов выбрать для каждого слоя.
# В главе 4 вы познакомитесь с формальными принципами, помогающими сделать выбор. А пока вам остается только довериться мне в следующем выборе:
# 
# два промежуточных слоя с 16 скрытыми нейронами в каждом;
# 
# третий слой будет выводить скалярное значение — оценку направленности текущего отзыва.

# Промежуточные слои будут использовать операцию relu в качестве функции активации, а последний слой будет использовать сигмоидную функцию активации и выводить вероятность (оценку вероятности, между 0 и 1 того, что образец относится к классу «1», то есть насколько он близок к положительному отзыву). Функция relu (rectified linear unit — блок линейной ректификации) используется для преобразования отрицательных значений в ноль (рис. 3.4), а сигмоидная функция рассредоточивает произвольные значения по интервалу [0, 1] (рис. 3.5), возвращая значения, которые можно интерпретировать как вероятность.

# Листинг 3.3. Определение модели


from keras import models
from keras import layers
model = models.Sequential()
model.add(layers.Dense(16, activation='relu', input_shape=(10000,)))
model.add(layers.Dense(16, activation='relu'))
model.add(layers.Dense(1, activation='sigmoid'))
# model.add(layers.Dense(1, activation='softmax'))





# ЧТО ТАКОЕ ФУНКЦИИ АКТИВАЦИИ И ЗАЧЕМ ОНИ НУЖНЫ?
# Без функции активации, такой как relu (также называемой фактором нелинейности), слой Dense будет состоять из двух линейных операций — скалярного произведения и сложения:

# output = dot(W, input) + b 

# Такой слой сможет обучаться только на линейных (аффинных) преобразованиях входных данных: пространство гипотез слоя было бы совокупностью всех возможных линейных преобразований входных данных в 16-мерное пространство. Такое пространство гипотез слишком ограниченно, и наложение нескольких слоев представлений друг на друга не приносило бы никакой выгоды, потому что глубокий стек линейных слоев все равно реализует линейную операцию: добавление новых слоев не расширяет пространства гипотез.
# Чтобы получить доступ к более обширному пространству гипотез, дающему дополнительные выгоды от увеличения глубины представлений, необходимо применить нелинейную функцию, или функцию активации. Функция активации relu — самая популярная в глубоком обучении, однако на выбор имеется еще несколько функций активации с немного странными на первый взгляд именами: prelu, elu и т. д.


# Наконец, нужно выбрать функцию потерь и оптимизатор. Так как перед нами стоит задача бинарной классификации и результатом работы сети является вероятность (наша сеть заканчивается одномодульным слоем с сигмоидной функцией активации), предпочтительнее использовать функцию потерь binary_crossentropy. Но это не единственный приемлемый выбор: можно также задействовать, например, mean_squared_error. Однако перекрестная энтропия обычно дает более качественные результаты, когда результатами работы моделей являются вероятности. Перекрестная энтропия (crossentropy) — это термин из области теории информации, обозначающий меру расстояния между распределениями вероятностей, или в данном случае — между фактическими данными и предсказаниями.
# На этом шаге мы настраиваем модель оптимизатором rmsprop и функцией потерь binary_crossentropy. Обратите внимание, что мы также задали мониторинг точности во время обучения.

# Листинг 3.4. Компиляция модели

model.compile(optimizer='rmsprop', loss='binary_crossentropy', metrics=['accuracy'])




# Оптимизатор, функция потерь и метрики передаются в виде строковых значений, что становится возможным, поскольку rmsprop, binary_crossentropy и accuracy являются частью Keras. Иногда бывает желательно настроить параметры оптимизатора или передать свою функцию потерь или метрик. Первую задачу можно решить путем передачи в аргументе optimizer экземпляра класса оптимизатора, как показано в листинге 3.5, а последнюю — путем передачи в аргументе loss и (или)metrics объекта функции, как показано в листинге 3.6.



# Листинг 3.5. Настройка оптимизатора

from keras import optimizers

model.compile(optimizer=optimizers.RMSprop(learning_rate=0.001),loss='binary_crossentropy', 
              metrics=['accuracy'])

# Листинг 3.6. Использование нестандартных функций потерь и метрик


from keras import losses
from keras import metrics

model.compile(optimizer=optimizers.RMSprop(learning_rate=0.001),loss=losses.binary_crossentropy,
              metrics=[metrics.binary_accuracy])

# 3.4.4. Проверка решения
# Чтобы проконтролировать точность модели во время обучения на данных, которые она прежде не видела, создадим проверочный набор, выбрав 10 000 образцов из оригинального набора обучающих данных.


# Листинг 3.7. Создание проверочного набора
x_val = x_train[:10000]
partial_x_train = x_train[10000:]
y_val = y_train[:10000]
partial_y_train = y_train[10000:]

# Теперь проведем обучение модели в течение 20 эпох (выполнив 20 итераций по всем образцам в тензорах x_train и y_train) пакетами по 512 образцов. В то же время будем следить за потерями и точностью на 10 000 отложенных образцов. Для этого достаточно передать проверочные данные в аргументе validation_data.

# Листинг 3.8. Обучение модели

model.compile(optimizer='rmsprop', loss='binary_crossentropy',  metrics=['accuracy'])

# or 


# model.compile(optimizer=optimizers.RMSprop(learning_rate=0.001),
#               loss=losses.binary_crossentropy,
#               metrics=[metrics.binary_accuracy])

history = model.fit(partial_x_train, partial_y_train, epochs=20, batch_size=512, validation_data=(x_val, y_val))



# 30/30 [==============================] - 1s 21ms/step - loss: 0.6931 - accuracy: 0.5035 - val_loss: 0.6933 -  val_accuracy: 0.4947     its response  hisory  - > model fit

# Обратите внимание на то, что вызов model.fit() возвращает объект History. Этот объект имеет поле history — словарь с данными обо всем происходившем в процессе обучения. Заглянем в него:
    
history_dict = history.history
history_dict.keys()
# [u'acc', u'loss', u'val_acc', u'val_loss']


# Словарь содержит четыре элемента — по одному на метрику, — за которыми осуществлялся мониторинг в процессе обучения и проверки.
# В следующих двух листингах используется библиотека Matplotlib для вывода графиков потерь (рис. 3.7),
# а также графиков точности на этапах обучения и проверки (рис. 3.8).
# Имейте в виду, что у вас результаты могут несколько различаться, что обусловлено различием в случайных числах,
# использовавшихся для инициализации сети.

# Листинг 3.9. Формирование графиков потерь на этапах обучения и проверки


import matplotlib.pyplot as plt


history_dict = history.history

loss_values = history_dict['loss']

val_loss_values = history_dict['val_loss']

val_acc_values = history_dict['accuracy']


epochs = range(1, len(val_acc_values ) + 1)


plt.plot(epochs, loss_values, 'bo', label='Training loss')   # «bo» означает «blue dot» — «синяя точка»
plt.plot(epochs, val_loss_values, 'b', label='Validation loss') # «b» означает «solid blue line» — «сплошная синяя линия»
plt.title('Training and validation loss')
plt.xlabel('Epochs')
plt.ylabel('Loss')
plt.legend()
plt.show()


# Листинг 3.10. Формирование графиков точности на этапах обучения и проверки
plt.clf() # Очистить рисунок
# acc_values = history_dict['acc']
val_acc = history_dict['val_accuracy']

acc = history_dict['accuracy']
plt.plot(epochs, acc, 'bo', label='Training acc')
plt.plot(epochs, val_acc, 'b', label='Validation acc')
plt.title('Training and validation accuracy')
plt.xlabel('Epochs')
plt.ylabel('Accuracy')
plt.legend()
plt.show()



# Как видите, на этапе обучения потери снижаются с каждой эпохой, а точность растет.
# Именно такое поведение ожидается от оптимизации градиентным
# спуском: величина, которую вы пытаетесь минимизировать, должна становиться все меньше с каждой итерацией.
# Но это не относится к потерям и точности на этапе проверки: похоже, что они достигли пика в четвертую эпоху.
# Это пример того, о чем мы предупреждали выше: модель, показывающая хорошие результаты на обучающих данных, не
# обязательно будет показывать такие же хорошие результаты на данных, которые не видела прежде. Выражаясь точнее,
# в данном случае наблюдается переобучение: после второй эпохи произошла чрезмерная оптимизация на обучающих данных,
# и в результате получилось представление, характерное для обучающих данных, не обобщающее данные за пределами обучающего набора.
# В данном случае для предотвращения переобучения можно прекратить обучение после третьей эпохи. Вообще говоря,
# есть целый спектр приемов, ослабляющих эффект переобучения, которые мы рассмотрим в главе 4.

# А теперь обучим новую сеть с нуля в течение четырех эпох и затем оценим получившийся результат на контрольных данных.


# Листинг 3.11. Обучение новой модели с нуля

# model.compile(optimizer='rmsprop', loss='binary_crossentropy', metrics=['accuracy'])
# model.fit(x_train, y_train, epochs=4, batch_size=512)

regularizers.l1(0.001)# L1-регуляризация
regularizers.l1_l2(l1=0.001, l2=0.001)# Объединенная L1- и L2-регуляризация

model = models.Sequential()
# model.add(layers.Dense(4,  activation='relu',input_shape=(10000,)))
# model.add(layers.Dense(4, activation='relu'))
model.add(layers.Dense(4, kernel_regularizer=regularizers.l2(0.002),
activation='relu', input_shape=(10000,)))
model.add(layers.Dropout(0.5))
model.add(layers.Dense(4, kernel_regularizer=regularizers.l2(0.002),
activation='relu'))
model.add(layers.Dropout(0.5))
model.add(layers.Dense(1, activation="sigmoid"))

# model.compile(optimizer='adam',loss='mse', metrics=['accuracy'])
model.compile(optimizer='rmsprop', loss='mse',  metrics=['accuracy'])
history = model.fit(partial_x_train, partial_y_train, epochs=20, batch_size=128, validation_data=(x_val, y_val))
results = model.evaluate(x_test, y_test)
model.predict(x_test)


model = models.Sequential()
model.add(layers.Dense(64, activation='relu',input_shape=(10000,)))
model.add(layers.Dense(64, kernel_regularizer=regularizers.l2(0.001), activation='relu'))
model.add(layers.BatchNormalization())
model.add(layers.Dense(32, activation='relu'))

model.add(layers.Dense(1, activation='sigmoid',))

# model.compile(optimizer=optimizers.RMSprop(learning_rate=0.001),loss='binary_crossentropy', 
#               metrics=['binary_accuracy'])
# model.compile(optimizer='rmsprop', loss='binary_crossentropy',  metrics=['accuracy'])

model.compile(optimizer='adam', loss=losses.BinaryCrossentropy(from_logits=True),
              metrics=['accuracy'])


# model.fit(x_train, y_train, epochs=5, batch_size=512)
history = model.fit(partial_x_train, partial_y_train, epochs=10, batch_size=512, validation_data=(x_val, y_val))
results = model.evaluate(x_test, y_test)
model.predict(x_test)
# >>> results  my 
# [0.6931537389755249, 0.5000399947166443]

# Конечные результаты:
# >>> results    (book)
# [0.2929924130630493, 0.88327999999999995]


# 3.4.5. Использование обученной сети для предсказаний на новых данных
# После обучения сети ее можно использовать для решения практических задач. Например, попробуем предсказать вероятность того, что отзывы будут положительными, с помощью метода predict:
model.predict(x_test)

# Use of REGULARIZATION
model = models.Sequential()
model.add(layers.Dense(16, kernel_regularizer=regularizers.l1_l2(l1=0.001, l2=0.001),activation='relu', input_shape=(10000,)))
model.add(layers.Dense(16, kernel_regularizer=regularizers.l1_l2(l1=0.001, l2=0.001),activation='relu'))
model.add(layers.Dense(1, activation='sigmoid'))
# array([[ 0.98006207]
# [ 0.99758697]
# [ 0.99975556]
# ...,
# [ 0.82167041]
# [ 0.02885115]
# [ 0.65371346]], dtype=float32)
# Как видите, сеть уверена в одних образцах (0,99 или выше или 0,01 или ниже), но не так уверена в других (0,6; 0,4).


# 3.4.6. Дальнейшие эксперименты
# Следующие эксперименты помогут вам убедиться, что выбор именно таких параметров архитектуры сети был достаточно разумным, хотя место для улучшения все же остается.
# 102 Глава 3 • Начало работы с нейронными сетями
# 
# В данном примере использовались два скрытых слоя. Попробуйте использовать один или три и посмотрите, как это повлияет на точность на этапах обучения и проверки.
# 
# Попробуйте использовать слои с большим или с меньшим количеством скрытых нейронов: 32 нейрона, 64 нейрона и т. д.
# 
# Попробуйте вместо binary_crossentropy использовать функцию потерь mse.
# 
# Попробуйте вместо relu использовать функцию активации tanh (она была популярна на заре становления нейронных сетей).

# 3.4.7. Подведение итогов

# Вот какие выводы вы должны сделать из этого примера:
# 
# Обычно исходные данные приходится подвергать некоторой предварительной обработке, чтобы передать их в нейронную сеть в виде тензоров. Последовательности слов можно преобразовать в бинарные векторы, но существуют также другие варианты.
# 
# Стек слоев Dense с функцией активации relu способен решать широкий круг задач (включая классификацию эмоциональной окраски), и вы, вероятно, чаще всего будете использовать именно эту комбинацию.
# 
# В задаче бинарной классификации (с двумя выходными классами) в конце вашей нейросети должен находиться слой Dense с одним нейроном и функцией активации sigmoid: результатом работы сети должно быть скалярное значение в диапазоне между 0 и 1, представляющее собой вероятность.
# 
# С таким скалярным результатом, получаемым с помощью сигмоидной функции, в задачах бинарной классификации следует использовать функцию потерь binary_crossentropy.
# 
# В общем случае оптимизатор rmsprop является наиболее подходящим выбором для любого типа задач. Одной головной болью меньше для вас.
# 
# По мере улучшения на обучающих данных нейронные сети рано или поздно начинают переобучаться, демонстрируя ухудшение результатов на данных, которые они прежде не видели.
# Поэтому всегда контролируйте качество работы сети на данных не из обучающего набора.




# 3.5. Классификация новостных лент: пример классификации в несколько классов
# В предыдущем разделе вы увидели, как можно классифицировать векторы входных данных на два взаимоисключающих класса с использованием полносвязной нейронной сети.
# Но как быть, если количество классов больше двух?

(train_data, train_labels), (test_data, test_labels) = imdb.load_data(num_words=10000)


partial_y_train_one_hot = to_categorical(partial_y_train, num_classes=2)
y_val_one_hot = to_categorical(y_val, num_classes=2)

model = models.Sequential()
model.add(layers.Dense(16, activation='relu', input_shape=(10000,)))
model.add(layers.Dense(16, activation='relu'))
model.add(layers.Dense(1, activation='sigmoid'))  # Use 2 for binary classification

model.compile(optimizer='rmsprop', loss='categorical_crossentropy', metrics=['accuracy'])

history = model.fit(partial_x_train, partial_y_train_one_hot, epochs=10, batch_size=512, validation_data=(x_val, y_val_one_hot))