
# # Replace the deprecated function with the suggested replacement
# from tensorflow.compat.v1.losses import sparse_softmax_cross_entropy



# 3.5. Классификация новостных лент: пример классификации в несколько классов





# В предыдущем разделе вы увидели, как можно классифицировать векторы входных данных на два взаимоисключающих класса с использованием полносвязной нейронной сети. Но как быть, если количество классов больше двух?

# В этом разделе мы создадим сеть для классификации новостных лент агентства Reuters на 46 взаимоисключающих тем. Так как теперь количество классов больше двух, эта задача относится к категории задач многоклассовой классификации; и, поскольку каждый экземпляр данных должен быть отнесен только к одному классу, эта задача является примером однозначной многоклассовой классификации. Если бы каждый экземпляр данных мог принадлежать нескольким классам (в данном случае темам), эта задача была бы примером многозначной многоклассовой классификации.

# 3.5.1. Набор данных Reuters
# Мы будем работать с набором данных Reuters — выборкой новостных лент и их тем, публиковавшихся агентством Reuters в 1986 году. Это простой набор данных, широко используемых для классификации текста. Существует 46 разных тем; некоторые темы более широко представлены, некоторые — менее, но для каждой из них в обучающем наборе имеется не менее 10 примеров.
# Подобно IMDB и MNIST, набор данных Reuters поставляется в составе Keras. Давайте заглянем в него.

# Листинг 3.12. Загрузка данных Reuters


from keras.datasets import reuters
(train_data, train_labels), (test_data, test_labels) = reuters.load_data(
num_words=10000)


# По аналогии с примером IMDB, аргумент num_words=10000 ограничивает данные 10 000 наиболее часто встречающимися словами.
# Всего у нас имеется 8982 обучающих и 2246 контрольных примеров:

# >>> train_data[10]
# [1, 245, 273, 207, 156, 53, 74, 160, 26, 14, 46, 296, 26, 39, 74, 2979,
# 3554, 14, 46, 4689, 4329, 86, 61, 3499, 4795, 14, 61, 451, 4329, 17, 12]
# Вот как можно декодировать индексы в слова, если это представляет для вас интерес.


# Листинг 3.13. Декодирование новостей обратно в текст



word_index = reuters.get_word_index()

reverse_word_index = dict([(value, key) for (key, value) in word_index.items()])

decoded_newswire = ' '.join([reverse_word_index.get(i - 3, '?') for i in train_data[0]]) #Обратите внимание, что индексы смещены на 3, потому что индексы 0, 1 и 2 зарезервированы для слов «padding» (отступ), «start of sequence» (начало последовательности) и «unknown» (неизвестно)


# Метка, определяющая класс примера, — это целое число между 0 и 45 — индекс темы:
# >>> train_labels[10]
# 3



# 3.5.2. Подготовка данных
# Для векторизации данных можно повторно использовать код из предыдущего примера.

# Листинг 3.14. Кодирование данных


import numpy as np

def vectorize_sequences(sequences, dimension=10000):
    results = np.zeros((len(sequences), dimension))
    for i, sequence in enumerate(sequences):
        results[i, sequence] = 1.
        
    return results


x_train = vectorize_sequences(train_data) # Векторизованные обучающие данные
x_test = vectorize_sequences(test_data) # Векторизованные контрольные данные




# Векторизовать метки можно одним из двух способов: сохранить их в тензоре целых чисел или использовать прямое кодирование. Прямое кодирование (one-hot encoding) широко используется для форматирования категорий и также называется кодированием категорий (categorical encoding). Более подробно прямое кодирование объясняется в разделе 6.1. В данном случае прямое кодирование меток заключается в конструировании вектора с нулевыми элементами со значением 1 в элементе, индекс которого соответствует индексу метки. Например:
    
    
    
    
    
def to_one_hot(labels, dimension=46):
    results = np.zeros((len(labels), dimension))
    for i, label in enumerate(labels):
        results[i, label] = 1.
    return results

one_hot_train_labels = to_one_hot(train_labels)
one_hot_test_labels = to_one_hot(test_labels)

# Векторизовать метки можно одним из двух способов:

# Следует отметить, что этот способ уже реализован в Keras, как мы видели в примере MNIST:

from keras.utils.np_utils import to_categorical

one_hot_train_labels = to_categorical(train_labels)# Векторизованные обучающие данные
one_hot_test_labels = to_categorical(test_labels)# Векторизованные контрольные данные


# 3.5.3. Конструирование сети
# Задача классификации по темам напоминает предыдущую задачу классификации отзывов: в обоих случаях мы пытаемся классифицировать короткие фрагменты текста. Но в данном случае количество выходных классов увеличилось с 2 до 46. Размерность выходного пространства теперь намного больше.
# В стеке слоев Dense, как в предыдущем примере, каждый слой имеет доступ только к информации, предоставленной предыдущим слоем. Если один слой отбросит какую-то информацию, важную для решения задачи классификации, последующие слои не смогут восстановить ее: каждый слой может стать узким местом для информации. В предыдущем примере мы использовали 16-мерные промежуточные слои, но 16-мерное пространство может оказаться слишком ограниченным для классификации на 46 разных классов: такие малоразмерные слои могут сыграть роль «бутылочного горлышка» для информации, не пропуская важные данные.
# По этой причине в данном примере мы будем использовать слои с большим количеством измерений. Давайте выберем 64 нейрона.



# Листинг 3.15. Определение модели


from keras import models
from keras import layers
model = models.Sequential()
model.add(layers.Dense(64, activation='relu', input_shape=(10000,)))
model.add(layers.Dense(64, activation='relu'))
model.add(layers.Dense(46, activation='softmax'))

# Отметим еще две особенности этой архитектуры:
# 
# Сеть завершается слоем Dense с размером 46. Это означает, что для каждого входного образца сеть будет выводить 46-мерный вектор. Каждый элемент этого вектора (каждое измерение) представляет собой отдельный выходной класс.
# 
# Последний слой использует функцию активации softmax. Мы уже видели этот шаблон в примере MNIST. Он означает, что сеть будет выводить распределение вероятностей по 46 разным классам — для каждого образца на входе сеть будет возвращать 46-мерный вектор, где output[i] — вероятность принадлежности образца классу i. Сумма 46 элементов всегда будет равна 1.


# Лучшим вариантом в данном случае является использование функции потерь categorical_crossentropy. Она определяет расстояние между распределениями вероятностей: в данном случае между распределением вероятности на выходе сети и истинным распределением меток. Минимизируя расстояние между этими двумя распределениями, мы учим сеть выводить результат, максимально близкий к истинным меткам.


# Листинг 3.16. Компиляция модели

model.compile(optimizer='rmsprop',loss='categorical_crossentropy',metrics=['accuracy'])

# 3.5.4. Проверка решения
# Для контроля точности модели создадим проверочный набор, выбрав 1000 образцов из набора обучающих данных.


# Листинг 3.17. Создание проверочного набора

x_val = x_train[:1000]
partial_x_train = x_train[1000:]
y_val = one_hot_train_labels[:1000]
partial_y_train = one_hot_train_labels[1000:]


# Теперь проведем обучение модели в течение 20 эпох.


# Листинг 3.18. Обучение модели

history = model.fit(partial_x_train,partial_y_train,epochs=20,batch_size=512,validation_data=(x_val, y_val))


# Листинг 3.19. Формирование графиков потерь на этапах обучения и проверки

import matplotlib.pyplot as plt

loss = history.history['loss']
val_loss = history.history['val_loss']
epochs = range(1, len(loss) + 1)
plt.plot(epochs, loss, 'bo', label='потери на этапе обучения ')
plt.plot(epochs, val_loss, 'b', label='потери на этапе проверки')
plt.title('Training and validation loss')
plt.xlabel('Epochs')
plt.ylabel('Loss')
plt.legend()
plt.show()



# Листинг 3.20. Формирование графиков точности на этапах обучения и проверки

plt.clf()# Очистить рисунок

acc = history.history['accuracy']
val_acc = history.history['val_accuracy']
plt.plot(epochs, acc, 'bo', label='точность на этапе обучения')
plt.plot(epochs, val_acc, 'b', label='точность на этапе проверки')
plt.title('Training and validation accuracy')
plt.xlabel('Epochs')
plt.ylabel('Accuracy')
plt.legend()
plt.show()

# Переобучение сети наступает в девятой эпохе. Давайте теперь обучим новую сеть до девятой эпохи и затем оценим получившийся результат на контрольных данных.


# Листинг 3.21. Обучение новой модели с нуля
model = models.Sequential()
model.add(layers.Dense(64, activation='relu', input_shape=(10000,)))
model.add(layers.Dense(64, activation='relu'))
model.add(layers.Dense(46, activation='softmax'))
model.compile(optimizer='rmsprop',
loss='categorical_crossentropy',
metrics=['accuracy'])

model.fit(partial_x_train,partial_y_train,epochs=5,batch_size=512,validation_data=(x_val, y_val))

results = model.evaluate(x_test, one_hot_test_labels)

# [0.9653292894363403, 0.7764915227890015] my 
# Конечные результаты:
    
# >>> results
# [0.9565213431445807, 0.79697239536954589] book

# Это решение достигло точности ~80 %. Со сбалансированной задачей бинарной классификации точность чисто случайного классификатора составила бы 50 %. Однако в данном случае она близка к 19 %, то есть результат получился весьма неплохим, по крайней мере в сравнении со случайным решением:
    
import copy
test_labels_copy = copy.copy(test_labels)
np.random.shuffle(test_labels_copy)
hits_array = np.array(test_labels) == np.array(test_labels_copy)

float(np.sum(hits_array)) / len(test_labels)
0.18655387355298308




# 3.5.5. Предсказания на новых данных
# Теперь можно убедиться в том, что метод predict модели возвращает распределение вероятностей по всем 46 темам. Давайте сгенерируем предсказания для всех контрольных данных.

# Листинг 3.22. Получение предсказаний для новых данных
predictions = model.predict(x_test)
# Каждый элемент в predictions — это вектор с длиной 46:
    
predictions[0].shape
(46,)

# Сумма коэффициентов этого вектора равна 1:
# >>> np.sum(predictions[0])
# 1.0
# Наибольший элемент, элемент с наибольшей вероятностью, — это предсказанный класс:
# >>> np.argmax(predictions[0])
# 4



# 3.5.6. Другой способ обработки меток и потерь
# Выше упоминалось, что метки также можно было бы преобразовать в тензор целых чисел, как показано ниже:

y_train = np.array(train_labels)
y_test = np.array(test_labels)
# Единственное, что изменилось в данном случае, — функция потерь. В листинге 3.21 использовалась функция потерь categorical_crossentropy, предполагающая, что метки получены методом кодирования категорий. С целочисленными метками следует использовать функцию sparse_categorical_crossentropy:

model.compile(optimizer='rmsprop',loss='sparse_categorical_crossentropy',metrics=['acc'])


# С математической точки зрения эта новая функция потерь равноценна функции categorical_crossentropy; ее отличает только интерфейс.


# 3.5.7. Важность использования достаточно больших промежуточных слоев
# Выше уже говорилось, что не следует использовать слои, в которых значительно меньше 46 скрытых нейронов, потому что результат является 46-мерным. Теперь давайте посмотрим, что получится, если образуется узкое место для информации из-за промежуточных слоев с размерностями намного меньше 46, например четырехмерных.
# Теперь сеть показывает точность ~71 % — абсолютное падение составило 8 %. Это падение в основном обусловлено попыткой сжать большой объем информации (достаточной для восстановления гиперплоскостей, разделяющих 46 классов) в промежуточное пространство со слишком малой размерностью. Сети удалось вместить большую часть необходимой информации в эти четырехмерные представления, но не всю.






# Листинг 3.23. Модель с узким местом для информации

model = models.Sequential()
model.add(layers.Dense(128, activation='relu', input_shape=(10000,)))
model.add(layers.Dense(128, activation='relu'))

model.add(layers.Dense(46, activation='softmax'))

model.compile(optimizer='rmsprop',loss='categorical_crossentropy',metrics=['accuracy'])
model.fit(partial_x_train,partial_y_train,epochs=20,batch_size=128,validation_data=(x_val, y_val))


results = model.evaluate(x_test, one_hot_test_labels)

# 3.5.8. Дальнейшие эксперименты
# 
# Попробуйте использовать слои с большим или меньшим числом измерений: 128, 32 и т. д.
# 
# Мы использовали два скрытых слоя. Теперь попробуйте использовать один слой или три.


# 3.5.9. Подведение итогов
# Вот какие выводы вы должны сделать из этого примера:
# 
# Если вы пытаетесь классифицировать образцы данных по N классам, сеть должна завершаться слоем Dense размера N.
# 
# В задаче однозначной многоклассовой классификации заключительный слой сети должен иметь функцию активации softmax, чтобы он мог выводить распределение вероятностей между N классами.
# 
# Для решения подобных задач почти всегда следует использовать функцию потерь categorical_crossentropy. Она минимизирует расстояние между распределениями вероятностей, выводимыми сетью, и истинными распределениями целей.

# 
# Метки в многоклассовой классификации можно обрабатывать двумя способами:
# yy
# Кодировать метки с применением метода кодирования категорий (также известного как прямое кодирование) и использовать функцию потерь categorical_crossentropy.
# yy
# Кодировать метки как целые числа и использовать функцию потерь sparse_categorical_crossentropy.


# Когда требуется классифицировать данные относительно большого количества категорий, следует предотвращать появление в сети узких мест для информации из-за слоев с недостаточно большим количеством измерений.










