# 4 Основы машинного обучения

# Эта глава охватывает следующие темы:
    
# формы машинного обучения для решения задач помимо классификации и регрессии;

# формальные процедуры оценки моделей машинного обучения;

# подготовка данных для глубокого обучения; 9конструирование признаков;
 
# борьба с переобучением;

# обобщенный процесс решения задач машинного обучения


# 4 .1 . Четыре раздела машинного обучения
# В предыдущих примерах вы познакомились с тремя конкретными типами задач машинного обучения: бинарной классификацией, многоклассовой классификацией и скалярной регрессией. Все три являются примерами контролируемого обучения, когда целью является научиться сопоставлять исходные тренировочные данные с тренировочными целями.

# Контролируемое обучение — это лишь верхушка айсберга. Машинное обучение — это обширная область со сложным делением на разделы. Алгоритмы машинного обучения обычно делятся на четыре основные категории, которые описываются в следующих разделах.


    
# 4 .1 .1 . Контролируемое обучение
# Этот случай, безусловно, является наиболее распространенным. Его суть заклю- чается в том, чтобы научить модель отображать исходные данные в известные целевые значения (иногда их также называют аннотациями) на наборе примеров (часто аннотированных людьми). Все четыре примера, которые вы видели выше в этой книге, являются каноническими примерами контролируемого обучения. Вообще говоря, к этой категории относятся почти все современные способы при- менения глубокого обучения, такие как распознавание образов, распознавание речи, классификация изображений и перевод с одного языка на другой.
# Основную долю задач контролируемого обучения составляют классификация и регрессия, но есть и более экзотические варианты, включая следующие (с при- мерами):
# Генерация последовательностей — по заданной картинке предсказать заголовок, который ее описывает. Иногда генерацию последовательностей можно сформу- лировать как серию задач классификации (таких, как повторяющее предсказа- ние следующего слова в последовательности).
# Прогнозирование дерева синтаксиса — по имеющемуся предложению требуется спрогнозировать его разложение в дерево синтаксиса.
# Распознавание объектов — на имеющейся картинке требуется нарисовать рамки вокруг определенных объектов. Эту задачу тоже можно выразить как задачу классификации (по множеству возможных рамок классифицировать содержи- мое каждой) или как сочетание классификации и регрессии, когда координаты рамок предсказываются посредством векторной регрессии.
# Сегментирование изображений — по имеющейся картинке построить пиксель- ную маску для конкретного объекта.


# 4 .1 .2 . Неконтролируемое обучение
# Этот раздел машинного обучения заключается в поиске интересных преобра- зований входных данных без помощи каких-либо целевых значений для нужд визуализации, сжатия или очистки данных от шумов или для лучшего понимания взаимосвязей в данных. Неконтролируемое обучение — это основа анализа данных, оно часто оказывается необходимым шагом на пути изучения набора данных перед применением методов контролируемого обучения. Хорошо известными примерами неконтролируемого обучения являются понижение размерности и кластеризация.

# 4 .1 .3 . Самоконтролируемое обучение
# Это разновидность контролируемого обучения, которая имеет существенные отли- чия, а потому может быть выделена в отдельную категорию. Самоконтролируемое обучение контролируется без использования меток, расставленных человеком, — самоконтролируемое обучение можно считать контролируемым обучением без участия людей. Здесь также имеются метки (иначе это обучение не было бы контро- лируемым), однако они генерируются из исходных данных, обычно с применением эвристических алгоритмов


# 4 .1 .4 . Обучение с подкреплением
# Этот вид машинного обучения долгое время обходили вниманием, пока в Google DeepMind не добились успеха, обучив компьютер играть в игры Atari (а позднее в Go на высочайшем уровне). В обучении с подкреплением агент получает инфор- мацию о своем окружении и учится выбирать действия, максимизирующие неко- торую выгоду. Например, с помощью обучения с подкреплением можно получить нейронную сеть, которая «смотрит» на экран видеоигры и руководит действиями игрока, максимизируя количество очков.

# ГЛОССАРИЙ КЛАССИФИКАЦИИ И РЕГРЕССИИ
# Классификация и регрессия вводят множество специальных терминов . Некоторые из них уже встречались нам в предыдущих примерах, и еще больше их встретится в следу- ющих главах . Они имеют точные определения, характерные для машинного обучения, и вы должны знать их .



# • Образец (sample), или вход (input), — один экземпляр данных, поступающий в модель .

# • Прогноз, предсказание (prediction), или выход (output), — результат работы мо- дели .

# • Цель (target) — истина . То, что в идеале должна спрогнозировать модель по данным из внешнего источника .

# • Ошибка прогноза (prediction error), или значение уровня потерь (loss value), — мера расстояния между прогнозом модели и целью .

# • Классы (classes) — набор меток в задаче классификации, доступных для выбора . Например, в задаче классификации изображений с кошками и собаками доступны два класса: «собака» и «кошка» .

# • Метка (label) — конкретный экземпляр класса в задаче классификации . Напри- мер, если изображение No 1234 аннотировано как принадлежащее классу «со- бака», тогда «собака» является меткой для изображения No 1234 .
# • Эталоны (ground-truth), или аннотации (annotations), — все цели для набора данных, обычно собранные людьми .
# • Бинарная классификация (binary classification) — задача классификации, которая должна разделить входные данные на две взаимоисключающие категории .
# • Многоклассовая классификация (multiclass classification) — задача классифика- ции, которая должна разделить входные данные на более чем две категории . Примером может служить классификация рукописных цифр .
# • Многозначная, или нечеткая, классификация (multilabel classification) — зада- ча классификации, в которой каждому входному образцу можно присвоить не- сколько меток . Например, на картинке могут быть изображены кошка и собака вместе, и поэтому такая картинка должна аннотироваться двумя метками: «кош- ка» и «собака» . Количество меток, присваиваемых изображениям, обычно может меняться .

# • Скалярная регрессия (scalar regression) — задача, в которой цель является ска- лярным числом, лежащим на непрерывной числовой прямой . Хорошим примером может служить прогнозирование цен на жилье: разные цены из непрерывного диапазона .
# • Векторная регрессия (vector regression) — задача, в которой цель является на- бором чисел, лежащих на непрерывной числовой прямой . Например, регрессия по нескольким значениям (таким, как координаты прямоугольника, ограничива- ющего изображение) является векторной регрессией .
# • Пакет или мини-пакет (batch или mini-batch) — небольшой набор образцов (обычно от 8 до 128), обрабатываемых моделью одновременно . Число образцов часто является степенью двойки для более эффективного использования памяти GPU . В процессе обучения один мини-пакет используется в градиентном спуске для вычисления одного изменения весов модели .


# 4 .2 . Оценка моделей машинного обучения
# В трех примерах, представленных в главе 3, мы делили данные на тренировоч- ный и контрольный наборы. В процессе мы быстро выяснили причину, почему нельзя оценивать качество моделей по тем же данным, на которых производилось обучение: спустя всего несколько эпох во всех трех моделях возникал эффект переобучения. Другими словами, качество прогнозирования на данных, которые не участвовали в обучении, прекращало возрастать (или даже ухудшалось), тогда как на тренировочных данных качество прогноза всегда растет в ходе обучения.



# 4 .2 .1 . Тренировочные, проверочные и контрольные наборы данных
# Оценка модели всегда сводится к делению доступных данных на три набора: тре- нировочный, проверочный и тестовый (или контрольный). Вы обучаете модель на тренировочных данных и оцениваете с использованием проверочных. После создания окончательной версии модели вы тестируете ее с применением контроль- ных данных.



# Проверка с простым расщеплением выборки
# Некоторая часть данных выделяется в контрольный набор. Обучение производится на оставшихся данных, а оценка качества — на контрольных. Как уже говорилось в предыдущих разделах, для предотвращения утечек информации модель не должна настраиваться по результатам прогнозирования на контрольных данных, поэтому требуется также зарезервировать отдельный проверочный набор.
# Схематически проверка с простым расщеплением выборки выглядит, как показано на рис. 4.1. В листинге 4.1 демонстрируется простейшая реализация этого приема



# Листинг 4.1. Проверка с простым расщеплением выборки

num_validation_samples = 10000
# Перемешивание данных нередко весьма желательно
#
np.random.shuffle(data)

# Определение проверочного набора
validation_data = data[:num_validation_samples]

data = data[num_validation_samples:]
# Определение тренировочного набора

training_data = data[:]

# Обучение модели на тренировочных и оценка на проверочных данных

model = get_model()
model.train(training_data)
validation_score = model.evaluate(validation_data)

# В этой точке можно выполнить корректировку модели,
# повторно обучить ее, оценить, повторить корректировку...
# После настройки гиперпараметров часто желательно выполнить обучение окончательной модели на всех данных, не включенных в контрольный набор

model = get_model()
model.train(np.concatenate([training_data,validation_data]))
test_score = model.evaluate(test_data)


# Листинг 4.2. Перекрестная проверка по K блокам

k= 4
num_validation_samples = len(data) // k

np.random.shuffle(data)

validation_scores = []
for fold in range(k):
    # Выбор блока данных для проверки
    validation_data = data[num_validation_samples * fold: num_validation_samples * (fold + 1)]
    # Использовать остальные данные для обучения. Об- ратите внимание: оператор + здесь выполняет конка- тенацию списков, а не вычисляет сумму
    training_data = data[:num_validation_samples * fold] + data[num_validation_samples * (fold + 1):]
    # Создание совершенно новой (необученной) модели
    model = get_model()
    model.train(training_data)
    validation_score = model.evaluate(validation_data)
    validation_scores.append(validation_score)
    validation_score = np.average(validation_scores) #Обучение окончатель- ной модели на всех данных, не вошедших в контрольный набор
    
    # Общая оценка: среднее оценок по k блокам
    model = get_model()
    model.train(data)
    test_score = model.evaluate(test_data)




# Итерационная проверка по K блокам с перемешиванием
# Этот метод подходит для ситуаций, когда имеется относительно небольшой набор данных и требуется оценить модель максимально точно. Он показал свою высокую эффективность в состязаниях на сайте Kaggle. Суть его заключается в многократ- ном применении перекрестной проверки по K блокам с перемешиванием данных


# 4 .2 .2 . Что важно помнить
# Выбирая протокол оценки, всегда помните:

# о репрезентативности данных — наборы тренировочных и контрольных данных должны быть репрезентативными для всего объема имеющихся данных. На- пример, если вы пытаетесь классифицировать изображения рукописных цифр и имеете массив, в котором образцы упорядочены по классам, использование первых 80 % образцов для обучения и остальных 20 % для контроля приведет к тому, что тренировочный набор будет содержать классы 0–7, а контрольный набор — только классы 8–9. Эта ошибка может показаться смешной, однако ее совершают слишком часто. По этой причине всегда желательно перемешивать данные перед делением на тренировочный и контрольный наборы;

# о направлении оси времени — пытаясь предсказать будущее по прошлому (на- пример, погоду на завтра, движение товаров и т. д.), вы не должны производить перемешивание данных перед делением, потому что это создаст временную утечку: ваша модель фактически будет обучаться по данным в будущем. В таких ситуациях всегда нужно следить за тем, чтобы контрольные данные следовали непосредственно за тренировочными данными;
# об избыточности данных — если некоторые образцы присутствуют в данных в нескольких экземплярах (частое явление в реальном мире), перемешивание и деление данных на тренировочный и проверочный наборы приведет к появ- лению избыточности между тренировочным и проверочным наборами. По сути, вы будете проводить тестирование на части тренировочных данных, что является худшим из зол! Убедитесь в том, что тренировочный и проверочный наборы не пересекаются.

# 4 .3 . Обработка данных, конструирование признаков и обучение признаков
# Помимо оценки модели, мы должны затронуть еще один важный вопрос, пре- жде чем погрузиться в разработку моделей: как подготовить исходные данные и цели перед передачей их в нейронную сеть? Многие приемы обработки данных и конструирования признаков в значительной мере зависят от предметной об- ласти (например, подготовка текстовых данных или образов); мы рассмотрим их в следующих разделах на конкретных примерах. А пока познакомимся с основами, общими для всех предметных областей.

# 4 .3 .1 . Предварительная обработка данных
# для нейронных сетей
# Цель предварительной обработки данных — сделать исходные данные пригодными для передачи в нейронную сеть. Сюда входят векторизация, нормализация, обра- ботка недостающих значений и извлечение признаков.


# Векторизация
# Все входы и цели в нейронной сети должны быть тензорами чисел с плавающей точкой (или, в особых случаях, тензорами целых чисел). Какие бы данные вам ни требовалось обработать — звук, изображение, текст, — их сначала нужно преобра- зовать в тензоры. Этот шаг называется векторизацией данных. Например, в двух предыдущих примерах классификации текстовых данных мы начали с того, что преобразовали текст в списки целых чисел (представляющие собой последователь- ности слов) и применили прямое кодирование для превращения списков в тензоры данных типа float32. В примерах классификации изображений цифр и предска- зания цен на дома исходные данные уже имеют векторизованную форму, поэтому мы пропустили этот шаг.



# Нормализация значений
# В примере классификации цифр исходные черно-белые изображения цифр были представлены массивами целых чисел в диапазоне 0–255. Прежде чем передать эти данные в сеть, нам понадобилось привести числа к типу float32 и разделить каждое на 255, в результате чего у нас получились массивы чисел с плавающей точкой в диапазоне 0–1. Аналогично, в примере с предсказанием цен на дома у нас имелись наборы признаков со значениями в разных диапазонах: некоторые при- знаки были выражены значениями с плавающей точкой, другие — целочисленными значениями. Перед передачей данных в сеть нам понадобилось нормализовать каждый признак в отдельности, чтобы все они имели среднее значение, равное 0, и стандартное отклонение, равное 1.

# Чтобы упростить обучение сети, данные должны обладать следующими характеристиками:
# принимать небольшие значения — как правило, значения должны находиться в диапазоне 0–1;


# быть однородными — то есть все признаки должны принимать значения из при-
# мерно одного и того же диапазона.

# Кроме того, может оказаться полезной следующая практика нормализации, хотя она не всегда необходима (например, мы не использовали нормализацию в примере классификации цифр):

# нормализация каждого признака независимо, чтобы его среднее значение было равно 0;
# нормализация каждого признака независимо, чтобы его стандартное отклонение было равно 1.

# Это легко реализуется с применением массивов Numpy:



x -= x.mean(axis=0)#Предполагается, что x — это двумерная матрица данных с формой (образцы, свойства)
x /= x.std(axis=0)


# Обработка недостающих значений
# Иногда в исходных данных могут отсутствовать некоторые значения. Так, в при- мере с предсказанием цен на дома первым признаком (столбец с индексом 0 в дан- ных) был уровень преступности на душу населения. Как быть, если этот признак определен не во всех образцах? Если оставить все как есть, у нас будет недоставать значений в тренировочных или в контрольных данных.
# Вообще в случае с нейронными сетями вполне безопасно заменить недостающие входные значения нулями, при условии, что 0 не является осмысленным значени- ем. Обрабатывая данные, сеть поймет, что 0 означает отсутствие данных, и будет игнорировать это значение.

# 4 .3 .2 . Конструирование признаков
# Конструирование признаков — это процесс использования ваших собственных знаний о данных и алгоритме машинного обучения (в данном случае — нейронной сети), чтобы улучшить эффективность алгоритма применением предопределенных преобразований к данным перед передачей их в модель. Во многих случаях не сле- дует ожидать, что модель машинного обучения сможет обучиться на полностью произвольных данных. Данные должны передаваться в модель в виде, облегчающем ее работу.

# Рассмотрим простой пример. Допустим, нам нужно разработать модель, прини- мающую изображение циферблата часов со стрелками и возвращающую время



# 4 .4 . Переобучение и недообучение
# Во всех трех примерах из предыдущей главы: определение эмоциональной окраски отзыва, классификация по темам и регрессия цен на дома — качество модели на проверочных данных всегда достигало максимума после небольшого количества эпох и затем начинало падать — модель быстро достигала эффекта переобучения. Переобучение наблюдается во всех задачах машинного обучения. Умение справ- ляться с этим эффектом играет важную роль в машинном обучении.
# Основной проблемой машинного обучения является противоречие между оптими- зацией и общностью. Под оптимизацией понимается процесс настройки модели для получения максимального качества на тренировочных данных (обучение в машин- ном обучении), а под общностью — качество обученной модели на данных, которые она прежде не видела. Цель игры — добиться высокого уровня общности, но вы не можете управлять общностью, вы можете только настраивать модель, опираясь на тренировочные данные.

# Лучший способ предотвратить изучение моделью специфических или нерелевант- ных шаблонов, имеющих место в тренировочных данных, — увеличить объем тре- нировочных данных. Модель, обученная на большем объеме данных, будет иметь бо льшуюобщность.Еслиэтоневозможно,следующимлучшимспособомявляется регулирование качества информации или добавление ограничений на информацию, которую модели будет позволено сохранить. Если сеть может позволить себе со- хранить только небольшое количество шаблонов, процесс оптимизации заставит ее сосредоточиться на наиболее существенных из них, что увеличит шансы на до- стижение более высокого уровня общности.
# Борьба с переобучением таким способом называется регуляризацией. Рассмотрим некоторые распространенные приемы регуляризации и применим их на практике для улучшения модели классификации отзывов к фильмам из раздела 3.4.



4 .4 .1 . Уменьшение размера сети

Самый простой способ предотвратить переобучение — уменьшить размер модели: количество изучаемых параметров в модели (определяется количеством слоев и количеством нейронов (размерностью) в каждом слое). В глубоком обучении ко- личество изучаемых параметров в модели часто называют емкостью модели (model capacity). Очевидно, что чем бо льшим количеством параметров обладает модель, тем бо льшим объемом памяти она обладает и, соответственно, тем легче скатиться до прямого отображения тренировочных экземпляров в их цели — отображения без обобщения. Например, модель с 500 000 бинарными параметрами легко могла бы запомнить класс каждой цифры в обучающем наборе MNIST: нам понадобится всего 10 бинарных параметров для каждой из 50 000 цифр. Но такая модель оказалась бы практически бесполезной для классификации новых образцов цифр. Всегда помните об этом: модели глубокого обучения, как правило, хорошо подогнаны под трениро- вочные данные, но главная задача — достижение общности, а не подгонка под данные.



Листинг 4.3. Исходная модель 

from keras import models
from keras import layers


model = models.Sequential()
model.add(layers.Input(shape=(10000,)))
model.add(layers.Dense(16, activation='relu'))
model.add(layers.Dense(16, activation='relu'))
model.add(layers.Dense(1, activation='sigmoid'))

model = models.Sequential()
model.add(layers.Dense(16, activation='relu', input_shape=(10000,)))
model.add(layers.Dense(16, activation='relu'))
model.add(layers.Dense(1, activation='sigmoid'))

# Теперь попробуем заменить ее меньшей сетью (листинг 4.4).



# Листинг 4.4. Версия модели с меньшей емкостью

model = models.Sequential()
model.add(layers.Dense(4, activation='relu', input_shape=(10000,)))
model.add(layers.Dense(4, activation='relu'))
model.add(layers.Dense(1, activation='sigmoid'))

# Как видите, эффект переобучения уменьшенной сети возникает позже, чем исход- ной (после шести эпох, а не четырех), и после переобучения ее качество ухудшается более плавно.
# Теперь для контраста добавим сеть с большей емкостью — намного большей, чем необходимо для данной задачи (листинг 4.5).
# Листинг 4.5. Версия модели с намного большей емкостью

model = models.Sequential()
model.add(layers.Dense(512, activation='relu', input_shape=(10000,)))
model.add(layers.Dense(512, activation='relu'))
model.add(layers.Dense(1, activation='sigmoid'))


# 4 .4 .2 . Добавление регуляризации весов
# Возможно вы знакомы с принципом бритвы Оккама: если какому-то явлению можно дать два объяснения, правильным, скорее всего, будет более простое — имеющее меньшее количество допущений. Эта идея применима также к моделям, полученным с помощью нейронных сетей: для одних и тех же наборов тренировоч- ных данных и архитектуры сети существует множество наборов весовых значений (моделей), объясняющих данные. Более простые модели менее склонны к переобу- чению, чем сложные.

# Простая модель в данном контексте — это модель, в которой распределение значений параметров имеет меньшую энтропию (или модель с меньшим числом параметров, как было показано в предыдущем разделе). То есть типичный способ смягчения про- блемы переобучения заключается в уменьшении сложности сети путем ограничения значений ее весовых коэффициентов, что делает их распределение более равно- мерным. Этот прием называется регуляризацией весов, он реализуется добавлением в функцию потерь сети штрафа за увеличение весов и имеет две разновидности:
# L1-регуляризация (L1 regularization) — добавляемый штраф прямо пропорцио- нален абсолютным значениям весовых коэффициентов (L1-норма весов).
# L2-регуляризация (L2 regularization) — добавляемый штраф пропорционален квадратам значений весовых коэффициентов (L2-норма весов). В контексте нейронных сетей L2-регуляризация также называется сокращением весов (weight decay). Это два разных названия одного и того же явления: сокращение весов с математической точки зрения суть то же самое, что L2-регуляризация.

# В Keras регуляризация весов осуществляется путем передачи в слои именованных аргументов с экземплярами регуляризаторов весов. Рассмотрим пример добавления L2-регуляризации в сеть классификации отзывов о фильмах (листинг 4.6




# Листинг 4.6. Добавление L2-регуляризации весов в модель
from keras import regularizers

model = models.Sequential()
model.add(layers.Dense(16, kernel_regularizer=regularizers.l2(0.003),
activation='relu', input_shape=(10000,)))
model.add(layers.Dense(16, kernel_regularizer=regularizers.l2(0.002),
activation='relu'))
model.add(layers.Dense(1, activation='sigmoid'))

# l2(0.001) означает, что каждый коэффициент в матрице весов слоя будет добавлять 0.001 * weight_coefficient_value в общее значение потерь сети. Обратите внима- ние: так как штраф добавляется только на этапе обучения, величина потерь сети на этапе обучения будет намного выше, чем на этапе контроля.
# На рис. 4.7 показано влияние L2-регуляризации. Как видите, модель с L2-регу- ляризацией (точки) намного устойчивее к переобучению, чем исходная модель (крестики), даже при том, что обе модели имеют одинаковое количество пара- метров



# Вместо L2-регуляризации можно также использовать следующие регуляризаторы, входящие в состав Keras.
# Листинг 4.7. Разные регуляризаторы, доступные в Keras
from keras import regularizers

regularizers.l1(0.001)# L1-регуляризация
regularizers.l1_l2(l1=0.001, l2=0.001)# Объединенная L1- и L2-регуляризация


# 4 .4 .3 . Добавление прореживания
# Прореживание (dropout) — один из наиболее эффективных и распространенных приемов регуляризации для нейронных сетей, разработанный Джеффом Хинтоном (Geoff Hinton) и его студентами в Университете Торонто. Прореживание, которое применяется к слою, заключается в удалении (присваивании нуля) случайно вы- бираемым признакам на этапе обучения. Представьте, что в процессе обучения не- который уровень для данного образца на входе в нормальной ситуации возвращает вектор [0,2, 0,5, 1,3, 0,8, 1,1]. После применения прореживания некоторые элементы вектора получают нулевое значение: например, [0, 0,5, 1,3, 0, 1,1]. Коэффициент про- реживания — это доля обнуляемых признаков; обычно он выбирается в диапазоне от 0,2 до 0,5. На этапе тестирования прореживание не производится; вместо этого выходные значения уровня уменьшаются на коэффициент, равный коэффициенту прореживания, чтобы компенсировать разницу в активности признаков на этапах тестирования и обучения.





# Рассмотрим матрицу Numpy, содержащую результат слоя, layer_output, с формой (размер_пакета, признаки). На этапе обучения мы обнуляем случайно выбираемые значения в матрице:
    
layer_output *= np.random.randint(0, high=2, size=layer_output.shape) # На этапе обучения обнуляется 50% признаков в выводе

# На этапе тестирования мы уменьшаем результаты на коэффициент прореживания. В данном случае на коэффициент 0,5 (потому что прежде была отброшена половина признаков):
layer_output *= 0.5 #На этапе тестирования

# Обратите внимание на то, что этот процесс можно реализовать полностью на этапе обучения и оставить без изменения результаты, получаемые на этапе тестирования, что часто и делается на практике (рис. 4.8):


layer_output *= np.random.randint(0, high=2, size=layer_output.shape) # На этапе обучения
layer_output /= 0.5 # Обратите внимание: в данном случае происходит увеличение, а не уменьшение значений

# Этот прием может показаться странным и необоснованным. Каким образом он по- может справиться с переобучением? По словам Хинтона, основой для этого приема, кроме всего прочего, стал механизм, используемый банками для предотвращения мошенничества. Вот его слова: «Посещая свой банк, я заметил, что операционисты, обслуживающие меня, часто меняются. Я спросил одного из них, почему так про- исходит. Он сказал, что не знает, но им часто приходится переходить с места на место. Я предположил, что это делается для исключения мошеннического сговора клиента с сотрудником банка. Это навело меня на мысль, что удаление случайно

# выбранного подмножества нейронов из каждого примера может помочь предот- вратить заговор модели с исходными данными и тем самым ослабить эффект переобучения»1. Основная идея заключается в том, что введение шума в выход- ные значения может разбить случайно складывающиеся шаблоны, не имеющие большого значения (Хинтон называет их заговорами), которые модель начинает запоминать в отсутствие шума.

# В Keras добавить прореживание в сеть можно посредством уровня Dropout, кото- рый обрабатывает результаты работы слоя, стоящего непосредственно перед ним:
    
model.add(layers.Dropout(0.5))

# Давайте добавим два слоя Dropout в сеть IMDB и посмотрим, как это повлияет на
# эффект переобучения.



# Листинг 4.8. Добавление прореживания в сеть IMDB

model = models.Sequential()
model.add(layers.Dense(16, activation='relu', input_shape=(10000,)))
model.add(layers.Dropout(0.5))
model.add(layers.Dense(16, activation='relu'))
model.add(layers.Dropout(0.5))
model.add(layers.Dense(1, activation='sigmoid'))


# На рис. 4.9 показаны графики с результатами. И снова наблюдается улучшение в сравнение с оригинальной сетью.
# В качестве напоминания ознакомьтесь с наиболее распространенными способами ослабления проблемы переобучения нейронных сетей:
# увеличить объем тренировочных данных; уменьшить емкость сети;
# добавить регуляризацию весов; добавить прореживание.




# 4 .5 . Обобщенный процесс решения задач машинного обучения
# Мы представим универсальную схему, которую вы сможете использовать для решения любых задач машинного обучения. Эта схема связывает воедино идеи, описанные в этой главе: определение задачи, оценка, конструирование признаков и ослабление проблемы переобучения.




# 4 .5 .1 . Определение задачи и создание набора данных
# Прежде всего, необходимо определить задачу:
# Какой вид будут иметь входные данные? Что требуется предсказать? Вы смо- жете обучить сеть предсказывать что-либо только при наличии тренировочных данных: например, обучить сеть определять эмоциональную окраску отзывов к фильмам можно, если имеются отзывы и соответствующие аннотации. То есть доступность данных на этом этапе является ограничивающим фактором (у вас может не быть средств, чтобы заплатить людям, которые соберут для вас дан- ные).
# К какому типу относится задача, стоящая перед вами? Бинарная классифи- кация? Многоклассовая классификация? Скалярная регрессия? Векторная регрессия? Многоклассовая, многозначная (нечеткая) классификация? Что- то иное, например кластеризация, генерация или обучение с подкреплением? Идентификация типа задачи определит выбор архитектуры модели, функции потерь и т. д.


# Имейте в виду, что машинное обучение можно использовать только для запо- минания шаблонов, присутствующих в тренировочных данных. Модель сможет распознавать только то, что видела прежде. Использование моделей, обученных по данным из прошлого, для предсказания будущего возможно, только если будущее будет вести себя так же, как прошлое. Что в действительности встречается очень редко.


# 4 .5 .2 . Выбор меры успеха
# Чтобы держать ситуацию под контролем, нужно иметь возможность наблюдать за ней. Чтобы добиться успеха, важно определить, что понимается под успехом — близость? Точность и полнота? Удержание клиентов? Ваш показатель успеха будет определять выбор функции потерь — что именно должна оптимизировать ваша модель. Он должен быть прямо связан с вашими общими целями, такими как успех бизнеса, например.



# 4 .5 .3 . Выбор протокола оценки
# После определения цели необходимо также выяснить, как измерять движение к ней. Выше мы рассмотрели три распространенных протокола оценки:
# выделение из общей выборки отдельного проверочного набора данных — этот способ хорошо подходит при наличии большого объема данных;
# перекрестная проверка по K блокам — правильный выбор при небольшом ко- личестве исходных образцов, из которых нельзя выделить представительную выборку для проверки;
# итерационная проверка по K блокам с перемешиванием — позволяет с высокой точностью оценить модель, когда в вашем распоряжении имеется ограниченный объем данных.
# Просто выберите один из этих. В большинстве случаев первый поможет получить достаточно надежную оценку.


# 4 .5 .4 . Предварительная подготовка данных
# После того как определена задача и исходные данные для обучения, цель для оп- тимизации и порядок оценки предпринятого подхода, у вас есть практически все, чтобы начать обучение модели. Но прежде необходимо преобразовать исходные данные в формат, в котором их можно передать в модель машинного обучения — в данном случае в глубокую нейронную сеть:
# как было показано выше, данные должны быть помещены в тензоры; значения, помещаемые в тензоры, обычно требуют масштабирования и приве-
# дения к меньшим величинам: например, в диапазоне [–1, 1] или [0, 1];
# если значения разных признаков находятся в разных диапазонах (разнородные данные), их следует нормализовать;
# возможно, вам также понадобится выполнить конструирование признаков, особенно при небольшом объеме исходных данных.

# После того как тензоры с исходными и целевыми данными будут готовы, можно
# приступать к обучению модели.


# 4 .5 .5 . Разработка модели, более совершенной, чем базовый случай
# Ваша цель на этом этапе — достичь статистической мощности, то есть разработать небольшую модель, способную выдать более качественный результат по сравнению с базовым случаем. В примере классификации рукописных цифр из набора MNIST про любую модель, достигшую точности выше 0,1, можно сказать, что она обладает статистической мощностью; в примере IMDB таковой можно назвать любую мо- дель с точностью выше 0,5.


# Обратите внимание на то, что не всегда удается достичь статистической мощности. Если модель не в состоянии дать более высокую точность, чем простой случайный выбор (базовый случай) после опробования нескольких разумных архитектур, вполне возможно, что во входных данных отсутствует ответ на вопрос, который вы пытаетесь задать. Не забывайте, что вы ставите две гипотезы:
# гипотеза о том, что выходные данные можно предсказать по входным данным; гипотеза о том, что доступные данные достаточно информативны для изучения
# отношений между входными и выходными данными.
# Вполне возможно, что эти гипотезы ложны, и тогда вам придется выполнить про- ектирования с самого начала.
# Если все идет как надо, вам нужно сделать три ключевых выбора для создания первой рабочей модели:


# Функция активации для последнего уровня — устанавливает эффективные ограничения на результат сети. Например, в случае классификации отзывов из IMDB на последнем уровне используется функция sigmoid, в случае регрессии вообще не используется функция активации на последнем уровне и т. д.
# Функция потерь — должна соответствовать типу решаемой задачи. Например, в случае IMDB используется функция потерь binary_crossentropy, в случае регрессии используется функция mse и т. д.
# Конфигурация оптимизации — какой оптимизатор использовать? Какой выбрать шаг обучения? В большинстве случаев с успехом можно использовать rmsprop с шагом обучения по умолчанию.



# 4 .5 .6 . Масштабирование по вертикали: разработка модели с переобучением
# После получения модели, обладающей статистической мощностью, встает вопрос о достаточной мощности модели. Достаточно ли слоев и параметров, чтобы пра- вильно смоделировать задачу? Например, сеть с единственным скрытым (промежу- точным) слоем, имеющим два параметра, будет иметь некоторую статистическую мощность для классификации цифр из набора MNIST, но недостаточную, чтобы считать задачу решенной. Не забывайте о распространенной проблеме машинного обучения — противоречии между оптимизацией и общностью; идеальной считается модель, которая стоит непосредственно на границе между недообучением и пере- обучением, между недостаточной и избыточной емкостью. Чтобы понять, где про- легает эта граница, ее сначала нужно пересечь.
# Чтобы понять, насколько большой должна быть модель, сначала нужно сконстру- ировать модель, обладающую эффектом переобучения. Сделать это просто:
# 1. Добавьте слои.
# 2. Задайте большое количество параметров в слоях.
# 3. Обучите модель на большом количестве эпох.

# Постоянно контролируйте, как меняется уровень потерь на этапах обучения и про- верки, а также любые другие показатели на этих же этапах, которые вас интересуют. Ухудшение качества модели на проверочных данных свидетельствует о достижении эффекта переобучения.
# Следующий этап — регуляризация и настройка модели, чтобы как можно ближе подойти к идеальной модели, которая не страдает ни недообучением, ни переобу- чением.



# 4 .5 .7 . Регуляризация модели и настройка гиперпараметров
# Этот шаг занимает больше всего времени: вам придется многократно изменять свою модель, обучать ее, оценивать качество на проверочных данных (контрольные данные не должны принимать никакого участия в этом этапе), снова изменять ее и повторять этот цикл, пока качество модели не достигнет желаемого уровня. Вот кое-что из того, что вы должны попробовать:
# добавить прореживание;
# опробовать разные архитектуры: добавлять и удалять слои;
# добавить L1- и (или) L2-регуляризацию;
# опробовать разные гиперпараметры (например, число нейронов на слой или шаг обучения оптимизатора), чтобы найти оптимальные настройки;
# дополнительно можно выполнить цикл конструирования признаков: добавить новые признаки или удалить имеющиеся, которые не кажутся информатив- ными.


# Помните: каждый раз, когда вы используете обратную связь из процесса проверки для настройки модели, происходит утечка информации в модель. Если цикл по- вторяется лишь несколько раз, в этом нет ничего страшного; но если цикл проверки и настройки выполняется многократно, в конечном итоге это приведет к переобу- чению модели на проверочных данных (даже при том, что модель напрямую не получает их). Это снижает надежность процесса оценки.
# Получив удовлетворительную конфигурацию, можно обучить окончательный вариант модели на всех доступных данных (тренировочных и проверочных) и оце- нить ее качество на контрольном наборе. Если качество модели на контрольных данных окажется значительно хуже, чем на проверочных, это может означать, что ваша процедура проверки была ненадежной или в процессе настройки параметров модели проявился эффект переобучения на проверочных данных. В этом случае можно попробовать переключиться на использование другого, более надежного протокола оценки (такого, как итерационная проверка по K блокам с перемеши- ванием).

# Краткие итоги главы
# Определите задачу и данные, на которых будет проводиться обучение. Соберите эти данные и, если нужно, аннотируйте их.
# Выберите меру успеха — показатели, которые можно было бы отслеживать по проверочным данным.
# Выберите протокол оценки: будете ли вы оценивать по выделенному из общей выборки проверочному набору данных или методом перекрестной проверки по K блокам? Какую часть данных вы могли бы использовать для проверки?
# Разработайте первую модель, более совершенную, чем базовый случай: модель, обладающую статистической мощностью.
# Разработайте модель, страдающую эффектом переобучения.
# Выполните регуляризацию модели и настройте ее гиперпараметры, опираясь на оценку качества по проверочным данным. Многие исследования в области машинного обучения сосредоточены исключительно на этом шаге — однако не упускайте из виду общую картину.