from keras.datasets import mnist
from keras import models , layers
from keras.utils import to_categorical

import numpy as np

import matplotlib.pyplot as plt





# train_images, train_labels = тренерованчный набор (данные для обучения)
# после обучения модель будет проверяться тестоввым(или контрольным) набором test_images and test_labels


# Загрузка данных MNIST

  (train_images, train_labels), (test_images, test_labels) = mnist.load_data()


# mnist.load_data(): Эта функция загружает набор данных MNIST. В Keras обычно используется load_data()метод, предоставляемый модулем набора данных MNIST. Эта функция возвращает два кортежа — один для обучающих данных и меток, а другой — для тестовых данных и меток.

# (train_images, train_labels), (test_images, test_labels): это форма распаковки кортежа. Он присваивает возвращаемые значения mnist.load_data()четырем переменным — train_images, train_labels, test_imagesи test_labels.

# train_images: эта переменная будет содержать обучающие изображения, которые представляют собой изображения рукописных цифр размером 28x28 пикселей в оттенках серого (от 0 до 9).

# train_labels: эта переменная будет содержать соответствующие метки для обучающих изображений, указывающие фактическую цифру (от 0 до 9), которую представляет каждое изображение.

# test_images: эта переменная будет содержать тестовые изображения, используемые для оценки производительности модели машинного обучения.

# test_labels: эта переменная будет содержать метки тестовых изображений.

# После выполнения этой строки кода вы можете использовать переменные train_images, train_labels, test_imagesи test_labelsв своей модели машинного обучения для обучения и оценки ее производительности в наборе данных MNIST. Например, вы можете использовать эти данные для обучения нейронной сети распознаванию рукописных цифр.



digit = train_images[4]
plt.imshow(digit, cmap=plt.cm.binary)
plt.show()


my_slice = train_images[10:100]  #or my_slice = train_images[10:100, :,: ] or train_images[10:100, 0:28, 0:28 ]  #(90,28, 28)




# вот так например можна выбрать пиксели из оббласти 14х14 в правом нижнем углу каждого изображения

my_slice = train_images[:,14:,14:]
plt.imshow(my_slice, cmap=plt.cm.binary)


# оставив только квадоат 14х14 пикселей вв центре 
my_slice = train_images[:,7:, -7,7:-7]

# Подготовка данных

train_images = train_images.reshape((60000, 28 * 28))
train_images = train_images.astype('float32') / 255

test_images = test_images.reshape((10000, 28 * 28))
test_images = test_images.astype('float32') / 255

train_labels = to_categorical(train_labels)
test_labels = to_categorical(test_labels)


# Создание модели
network = models.Sequential()
network.add(layers.Dense(512, activation='relu', input_shape=(28 * 28,)))  # Исправленная строка
network.add(layers.Dense(10, activation='softmax'))
# Компиляция модели

network.compile(optimizer='rmsprop', loss='categorical_crossentropy', metrics=['accuracy'])

# studying  запускае 
network.fit(train_images, train_labels, epochs=5, batch_size=128)


test_loss, test_acc = network.evaluate(test_images, test_labels)
print('test_acc:', test_acc)


print(mnist,'>>>>>>><<')

поэлементтные операции
операции применяются к каждому елементу в  тензоре по оттдельности

relu and + (plus) 


def naive_relu(x):
  assert len(x.shape) == 2 # check if x двумерный тензор
  x = x.copy #исключитть затирание исходного тензора
  
  for i in range(x.shape[0]):
    for j in range(x.shape[1]):
      x[i, j] = max(x[i, j],0)
      
  return x



эта реализации naive_add  (сложение тензеров) поддерживает только сложение двумерных тензеров

с индентичными формами. НО в слое Dense 

def naive_add(x, y ):
  assert len(x.shape) == 2 # check if x двумерный тензор
  assert x.shape == y.shape  # check if x двумерный тензор
  x = x.copy #исключитть затирание исходного тензора
  
  for i in range(x.shape[0]):
    for j in range(x.shape[1]):
      x[i, j] += y[i,j]
      
  return x


# z = x + y  = #поелементное сложение

# z = np.maximum(z,0) -# поелементня операция relu 


def naive_add_matrix_and_vector(x,y):
  assert len(x.shape) == 2  #убедиться что х - двумерный тензор нумпи
  assert len(y.shape) == 1  #убедиться что y - вектор нумпи
  assert x.shape[1]  == y.shape[0]
  
  x = x.copy() #exclude removing base  tensor
  for i in range(x.shape[0]):
    for j in range(x.shape[1]):
      x[i, j] += y[i,j]
      
  return x


# next example  set element-wise operation "maximum" no 2 tensors with diff forms through expansion

x = np.random.random((64,3,32,10))
y = np.random.random((32,10))

z = np.maximum(x,y)

# etc ... //

#  поелементтное произведение  в нупи керас(в матем скаляр произвед обозначают ( . ) z = x . y )
z = np.dot(x,y)

# что же делает операция скалярного произведениея ? 

# для начала разберемся со скалярным произведением двух ввекторов х и у 

def naive_vector_dot(x,y):
  assert len(x.shape) == 1  #|убедиться что х and y - векторы numpy
  assert len(y.shape) == 1  #|
  assert x.shape[1]  == y.shape[0]
  
  z = 0. 
  for i in range(x.shape[0]):
    z += x[i] * y[i]
    
  return z

# обратить ввнимание что в результате скалярного произведения двух вектотров
# получается скаляр и в операции могут участовать только векторы с одинаковым
# количеством элементов


#  так же естьь ввозможость получить калчрное произведение матрицы х на веткор у ,
#  являющееся вектором, елементы котторого - скалярные произведенич строк х на у 
 
#  вот так реализ эта операция

def naive_matrix_vector_dot(x,y):
  assert len(x.shape) == 2  #убедиться что х - матрица нумпи
  assert len(y.shape) == 1  #убедиться что y - вектор нумпи
  assert x.shape[1]  == y.shape[0]  #первое измерение х должно совпадать с нудевым измерением у!
  
  z = np.zeros(x.shape[0]) #эта операци вернуттвектор с нудлевыми елементами , имеющий ту же форму что и у 
  for i in range(x.shape[0]):
    for j in range(x.shape[1]):
      z[i] += x[i, j] * y[j]
      
  return z

# так же можно было бы повтороно использоватьь код , написанный прежде, подчеркнув общность произведений матрицы на вектор и вектора на вектор

def naive_matrix_vector_dot(x,y):
  z = np.zeros(x.shape[0]) #эта операци вернуттвектор с нудлевыми елементами , имеющий ту же форму что и у 
  for i in range(x.shape[0]):
      z[i] +=  naive_vector_dot(x[i, :],y)
      
  return z

# обратите внимание что если один из двух тензоров имеет ndim > 1  скалярное произведение перестает біть симметтричсной операцией тот естьт результа

# dot(x,y) не совпадает с результатом dot (y , x)
# Разумеется, скалярное произведение можно распространить на тензоры с произ- вольным количеством осей.
# Наиболее часто на практике применяется скалярное произведение двух матриц.
# Получить скалярное произведение двух матриц, x и y (dot(x, y)), можно, только если x.shape[1] == y.shape[0].
# В результате получит- ся матрица с формой (x.shape[0], y.shape[1]),
# элементами которой являются скалярные произведения строк x на столбцы y. 
# Вот как могла бы выглядеть про- стейшая реализация:


def naive_matrix_dot(x,y):
  assert len(x.shape) == 2  #убедиться что х - матрицы Numpy
  assert len(y.shape) == 2  #убедиться что y - 
  assert x.shape[1]  == y.shape[0]  #первое измерение х должно совпадать с нудевым измерением у!
  
  z = np.zeros((x.shape[0],  y.shape[1])) #эта операци вернет матрицу заданой формы с нулевыми  елементами 
   
  for i in range(x.shape[0]): #  обход строка в х
    for j in range(y.shape[1]): # и столбцов в у
      row_x = x[i, :]
      column_y = y[:, j]
      z[i, j] = naive_vector_dot(row_x, column_y)
      
      
  return z

# Изменение формы тензора


# Третий вид операций с тензорами, который мы должны рассмотреть, — это измене- ние формы тензора.
# Эта операция не используется в слоях Dense нашей нейронной сети, 
# но мы использовали ее, когда готовили исходные данные для передачи в сеть:
  
train_images = train_images.reshape((60000, 28 * 28))


# Изменение формы тензора предполагает такое переупорядочение строк и столбцов, чтобы привести его форму к заданной.
# Разумеется, тензор с измененной формой имеет такое же количество элементов, что и исходный тензор.
# Чтобы было понят- нее, рассмотрим несколько простых примеров:

# >>> x = np.array([[0., 1.], [2., 3.],
# [4., 5.]]) >>> print(x.shape)
# (3, 2)

# >>> x = x.reshape((6, 1))
# >>> x
# array([[ 0.],
# [ 1.], [ 2.], [ 3.], [ 4.], [ 5.]])

# >>> x = x.reshape((2, 3))
# >>> x
# array([[ 0., 1., 2.],
# [ 3., 4., 5.]])


# Особый случай изменения формы, который часто встречается в практике, — это транспонирование.
# Транспонирование — это такое преобразование матрицы, когда строки становятся столбцами, а столбцы — строками, 

# то есть x[i, :] превращается в x[:, i]:
# >>> x = np.zeros((300, 20)) >>> x = np.transpose(x)
# >>> print(x.shape)
# (20, 300)


# 2 .3 .5 . Геометрическая интерпретация операций с тензорами
# Поскольку содержимое тензоров можно интерпретировать как координаты точек в некотором геометрическом пространстве,
# все операции с тензорами имеют гео- метрическую интерпретацию. Возьмем для примера операцию сложения.

# Пусть имеется следующий вектор:
  
  
A = [0.5, 1]



# Добавим новый вектор B = [1, 0.25] и сложим его с предыдущим. Чтобы получить результирующий вектор,
# представляющий сумму двух исходных векторов, доста- точно перенести начало одного вектора в конец другого (рис. 2.8).
# Элементарные геометрические операции, такие как аффинные преобразования, поворот, масштабирование и т. д.,
# можно выразить в виде операций с тензорами. Например, поворот двумерного вектора на угол theta выражается как скалярное произведение 
# на матрицу 
R = [u, v] размером 2 × 2, где u и v — векторы на плоско- сти: 
  
u = [cos(theta), sin(theta)] и v = [-sin(theta), cos(theta)].


# 2 .4 . Механизм нейронных сетей: оптимизация на основе градиента
# Как было показано в предыдущем разделе, каждый слой нейронной сети из нашего первого примера преобразует данные следующим образом:

output = relu(dot(W, input) + b)
# В этом выражении W и b — тензоры, являющиеся атрибутами слоя.
# Они называются весами, или обучаемыми параметрами слоя (атрибуты kernel и bias соответствен- но). 
# Эти веса содержат информацию, извлеченную сетью из обучающих данных.


# Ниже перечислены шаги, выполняемые в так называемом цикле обучения, который повторяется столько раз, сколько потребуется:
  
  
# 1. Извлекается пакет обучающих экземпляров x и соответствующих целей y.

# 2. Сеть обрабатывает пакет x (этот шаг называется прямым проходом) и получает
# пакет предсказаний y_pred.
# 3. Вычисляются потери сети на пакете, дающие оценку несовпадения между y_pred
# иy.
# 4. Корректируются веса сети так, чтобы немного уменьшить потери на этом пакете.



# 2 .4 .2 . Производная операций с тензорами: градиент
# Градиент — это производная операции с тензором, обобщение понятия производ- ной на функции с многомерными входными данными, то есть на функции, принимающие на входе тензоры.
# Рассмотрим входной вектор x, матрицу W, цель y и функцию потерь loss. Вы можете с помощью W вычислить приближение к цели y_pred и определить потери или не- соответствие, между кандидатом y_pred и целью y:

y_pred = dot(W, x)

loss_value = loss(y_pred, y)

# Если входные данные x и y зафиксированы, тогда это можно интерпретировать как функцию, отображающую значения W в значения потерь:

loss_value = f(W)
# Допустим, что W0 — текущее значение W. Тогда производной функции f в точ- ке W0 будет тензор gradient(f)(W0) с той же формой, что и W, в котором каждый
# элемент gradient(f) (W0)[i, j] определяет направление и величину изменения в loss_value, наблюдаемого при изменении W0[i, j]. Тензор gradient(f)(W0) — это градиент функции f(W) = loss_value в W0.


# Поэтому на практике используется алгоритм из четырех шагов, представленный в начале этого раздела: вы можете понемногу изменять параметры, опираясь на текущие значения потерь в случайном пакете данных. Поскольку функция диф- ференцируема, можно вычислить ее градиент, который позволяет эффективно реа- лизовать шаг 4. Если веса изменить в направлении, противоположном градиенту, потери с каждым циклом будут понемногу уменьшаться:
# 1. Извлекается пакет обучающих экземпляров x и соответствующих целей y.
# 2. Сеть обрабатывает пакет x и получает пакет предсказаний y_pred.
# 3. Вычисляются потери сети на пакете, дающие оценку несовпадения между y_pred иy.
# 4. Вычисляется градиент потерь для параметров сети (обратный проход).
# 5. Параметры корректируются на небольшую величину в направлении, противо- положном градиенту, например W -= step * gradient, и тем самым снижаются потери.


# Выглядит довольно просто! Я только что описал стохастический градиентный спуск на небольших пакетах
 (mini-batch stochastic gradient descent, minibatch SGD). Термин «стохастический» отражает тот факт,
# что каждый пакет данных выбирается случайно (в науке слово «стохастический» считается синонимом слова «случай- ный»).
# Рисунок 2.11 иллюстрирует происходящее на примере одномерных данных, когда сеть имеет только один параметр и в вашем
# распоряжении имеется только один обучающий образец.


# Примерами могут служить такие алгоритмы, как SGD с импульсом, Adagrad, RMSProp и некоторые другие. 
# Эти варианты известны как методы опти- мизации, или оптимизаторы.
# В частности, внимания заслуживает идея импульса, которая используется во многих этих вариантах.

# Импульс вводится для решения двух проблем SGD: невысокой скорости сходимости и попадания в локальный минимум.
# Взгляните на рис. 2.13,
# на котором изображена кривая функции потерь для параметра сети.


# Как видите, для значения данного параметра имеется локальный минимум: движение из этой точки влево или вправо повлечет увеличение 
# потери. Если кор- ректировка рассматриваемого параметра осуществляется методом градиентного спуска с маленьким шагом обучения,
# тогда процесс оптимизации может застрять в локальном минимуме, не найдя пути к глобальному минимуму.
# Таких проблем можно избежать, если использовать идею импульса, заимствован- ную из физики.
# Вообразите, что процесс оптимизации — это маленький шарик,


# катящийся вниз по кривой потерь. Если шарик имеет достаточно высокий импульс, он не застрянет в мелком овраге и окажется в 
# глобальном минимуме. Импульс реализуется путем перемещения шарика на каждом шаге, исходя не только из текущей величины наклона 
# (текущего ускорения), но также из текущей скорости (набранной в результате действия силы ускорения на предыдущем шаге).
# На прак- тике это означает, что приращение параметра w определяется не только по текущему значению градиента,
# но также по величине предыдущего приращения параметра, как показано в следующей упрощенной реализации:
  

past_velocity = 0.
momentum = 0.1 #Постоянное значение импульса while loss > 0.01: 
while loss > 0.01:  #Цикл оптимизации
  
  w, loss, gradient = get_current_parameters()
  velocity = past_velocity * momentum + learning_rate * gradient
  w = w + momentum * velocity - learning_rate * gradient
  past_velocity = velocity
  update_parameter(w)


# 2 .4 .3 . Стохастический градиентный спуск
# Теоретически минимум дифференцируемой функции можно найти аналитически. Как известно, минимум функции — это точка, где производная равна 0. То есть оста- ется только найти все точки, где производная обращается в 0, и выяснить, в какой из этих точек функция имеет наименьшее значение.
# Применительно к нейронным сетям это означает аналитический поиск комби- нации значений весов, при которых функция потерь будет иметь наименьшее значение. Этого можно добиться, решив уравнение 

 gradient(f)(W) = 0 для W. Это полиномиальное уравнение с N переменными, где N — количество весов в #сети. Решить уравнение для случая N = 2 или N = 3 не составляет труда, но превра- щается в #практически неразрешимую задачу для нейронных сетей, в которых количество параметров редко бывает #меньше нескольких тысяч и часто достигает нескольких десятков миллионов.


# 2 .4 .4 . Объединение производных: алгоритм обратного распространения ошибки


# В предыдущем алгоритме мы произвольно предположили, что, если функция диф- ференцируема, мы можем явно вычислить ее производную.
# На практике функция нейронной сети состоит из множества последовательных операций с тензорами, объединенных в одну цепочку,
# каждая из которых имеет простую, известную про- изводную. Например, пусть есть сеть f, состоящая из трех операций 
# с тензорами a, b и c и весовыми матрицами W1, W2 и W3:
  
f(W1, W2, W3) = a(W1, b(W2, c(W3)))

# Формула сообщает нам, что такую цепочку функций можно получить с использованием следующего тождества,
 которое называется цепным правилом: f(g(x)) = = f'(g(x)) * g'(x). Применение цепного правила к вычислению значений градиента 
# нейронной сети приводит к алгоритму, который называется обратным распространением ошибки (Backpropagation), 
# или обратным дифференцированием.
# Обратное распространение начинается с конечного значения потери и движется в обратном направлении,
# от верхних слоев к нижним, применяя цепное правило для вычисления вклада каждого параметра в значение потери.
# ========================**********************========================**********************
# ========================**********************
# ========================**********************
# ========================**********************

# В контексте машинного обучения и нейронных сетей термин "весовая матрица" обозначает матрицу, которая содержит веса,
# применяемые к входным данным.
# Веса используются для преобразования входных данных в выходные в рамках алгоритмов обучения нейронных сетей.

# Когда вы имеете слой нейронной сети, каждый нейрон в слое связан с каждым нейроном предыдущего слоя.
# Веса, представленные весовой матрицей, определяют вклад каждого входного значения в активацию соответствующего нейрона.
# Другими словами, если 
# X — входные данные, 
# W — весовая матрица, и 
# b — вектор смещения (bias), то выход 
# Y получается следующим образом:
# Y=X⋅W+b

# В весовой матрице в машинном обучении веса представлены элементами матрицы. 
# Если у вас есть входные данные X размерности((m×n), где 
# m — количество примеров в обучающем наборе, а 
# n — количество признаков, и весовая матрица 
# W размерности(n×p), где 

# p — количество нейронов в слое, то каждый элемент Wij представляет вес, применяемый к соответствующему признаку xij.

# Матрицу 
# W можно представить как набор весов, где каждый столбец матрицы соответствует весам, применяемым к нейрону в слое.
# Каждый элемент wij в этой матрице — это вес, применяемый к соответствующему входному признаку xij
# ========================**********************========================**********************========================**********************


# ========================**********************========================**********************========================**********************


# Вот наши входные данные:
(train_images, train_labels), (test_images, test_labels) = mnist.load_data()
train_images = train_images.reshape((60000, 28 * 28)) train_images = train_images.astype('float32') / 255
test_images = test_images.reshape((10000, 28 * 28)) test_images = test_images.astype('float32') / 255

# Теперь вы уже знаете, что входные данные типа float32 хранятся в тензорах Numpy, 
# имеющих форму (60000, 784) (обучающие данные) и (10000, 784) (контрольные данные) соответственно.

# Вот наша сеть:
network = models.Sequential()
network.add(layers.Dense(512, activation='relu', input_shape=(28 * 28,))) network.add(layers.Dense(10, activation='softmax'))

# Сейчас вы уже знаете, что эта сеть состоит из цепочки двух слоев Dense, 
# каждый из которых применяет к входным данным несколько простых операций с тензорами,

# и что эти операции вовлекают весовые тензоры. Весовые тензоры, являющиеся
# атрибутами слоев, — это место, где запоминаются знания, накопленные сетью.
# Вот как выглядел этап компиляции:
network.compile(optimizer='rmsprop', loss='categorical_crossentropy',
metrics=['accuracy'])


# Сейчас вы уже понимаете, что categorical_crossentropy — это функция потерь, которая используется в качестве сигнала
# обратной связи для обучения весовых тензоров и которую этап обучения стремится свести к минимуму.
# Вы также знаете, что снижение потерь достигается за счет применения алгоритма стохастического градиентного спуска на небольших пакетах.
# Точные правила, управляющие кон- кретным применением градиентного спуска, определяются оптимизатором rmsprop,
# который передается в первом аргументе.
# Наконец, вот как выглядел цикл обучения:


network.fit(train_images, train_labels, epochs=5, batch_size=128)


# Теперь вы знаете, что происходит в вызове fit: 
#   сеть начинает перебирать обучающие данные мини-пакетами по 128 образцов и выполняет 5 итераций
#   (каждая итерация по всем обучающим данным называется эпохой). Для каждого мини-пакета сеть вычисляет
#   градиенты весов с учетом потерь в пакете и изменяет значения весов в соответствующем направлении.
#   В течение пяти эпох сеть выполнит 2345 из- менений градиента (по 469 на эпоху), после чего потери сети окажутся достаточно низкими,
#   чтобы эта сеть смогла классифицировать рукописные цифры с высокой точностью.
# Теперь вы знаете большую часть из того, что нужно знать о нейронных сетях.


# Краткие итоги главы
# Обучение означает поиск комбинации параметров модели, минимизирующих функцию потерь для данного набора обучающих данных и 
#     соответствующих им целей.


# Обучение происходит путем извлечения пакетов случайных образцов данных и их целей и вычисления градиента параметров
# сети с учетом потерь в пакете. Затем параметры сети немного смещаются (величина смещения определяется скоростью обучения)
# в направлении, противоположном направлению градиента.


# Весь процесс обучения становится возможным благодаря тому обстоятель- ству, что нейронные сети являются цепочками 
# дифференцируемых операций с тензорами и, следовательно, позволяют применять цепное правило для вы- вода функции градиента, 
# отображающей текущие параметры и текущий пакет данных в значение градиента.


# В последующих главах вам часто будут встречаться два ключевых понятия — функции потерь и оптимизаторы. 
# Они должны быть определены до передачи данных в сеть.


# Функция потерь — это величина, которую требуется свести к минимуму в ходе обучения, поэтому она должна представлять собой 
#     меру успеха для решаемой вами задачи.
    
# Оптимизатор определяет точный способ использования градиента потерь для изменения параметров: например, это может быть
# оптимизатор RMSProp, реа- лизующий градиентный спуск с импульсом, и др.



# 3 Начало работы
# с нейронными сетями

# 9базовые компоненты нейронных сетей;
# 9введение в Keras;
# 9настройка рабочей станции для глубокого обучения;
# 9использование нейронных сетей для решения простых задач классификации и регрессии .

# 3 .1 . Анатомия нейронной сети
# Как мы узнали в предыдущих главах, обучение нейронных сетей сосредоточено на следующих объектах:
# слоях, которые объединяются в сеть (или модель);
# исходных данных и соответствующих им целях;
# функции потерь, которая определяет сигнал обратной связи, используемый для обучения;
# оптимизаторе, определяющем, как происходит обучение.


# Их связь можно представить, как показано на рис. 3.1: 
#   сеть состоит из слоев, которые объединяются в цепочку и 
#   отображают исходные данные в предсказа- ния. Затем функция потерь 
#   сравнивает эти предсказания с целями и возвращает значение потери:
#     меру соответствия предсказания, произведенного сетью, ожида- емому результату.
#     Оптимизатор использует это значение потери для изменения весов сети


# 3 .1 .3 . Функции потерь и оптимизаторы: ключи к настройке процесса обучения
# После того как вы определились с архитектурой сети, требуется также выбрать еще два параметра:
# Функцию потерь (целевую функцию), возвращающую количественную оценку, которая будет минимизироваться в процессе обучения. 
#     Представляет собой меру успеха в решении стоящей задачи.
    
# Оптимизатор, определяющий, как будет изменяться сеть под воздействием функции потерь.
#     Реализует конкретный вариант стохастического градиентного спуска (Stochastic Gradient Descent, SGD).
