# 6 .3 .1 . Задача прогнозирования температуры

# До сих пор мы рассматривали единственную разновидность последовательных данных — текстовые данные, такие как в наборах данных IMDB и Reuters. Однако последовательные данные можно найти во многих других областях, не только в обработке естественного языка. Во всех примерах в этом разделе будут исполь- зоваться временные последовательности данных о погоде, записанных на гидроме- теорологической станции в институте биогеохимии Макса Планка в Йене (Jena), Германия1.
# В этот набор данных включены замеры 14 разных характеристик (таких, как тем- пература, атмосферное давление, влажность, направление ветра и т. д.), выпол- нявшиеся каждые 10 минут в течение нескольких лет. Вообще сбор данных был начат в 2003-м, но в этот пример включены только данные за 2009–2016 годы. Этот набор данных идеально подходит для изучения принципов работы с числовыми временными рядами. Мы воспользуемся ими для создания модели, принимающей на входе некоторые данные о погоде в ближайшем прошлом (за несколько дней) и прогнозирующей температуру воздуха на ближайшие 24 часа в будущем.


# Листинг 6.28. Обзор набора метеорологических данных Jena
import os

data_dir = '/Users/ivan/Vscodebprojects/AIStudy/chp6/'
fname = os.path.join(data_dir, 'jena_climate_2009_2016.csv')
f = open(fname)
data = f.read()
f.close()
lines = data.split('\n') 
header = lines[0].split(',')
lines = lines[1:]
print(header)
print(len(lines))

["Date Time",
"p (mbar)",
"T (degC)",
"Tpot (K)",
"Tdew (degC)",
"rh (%)",
"VPmax (mbar)", "VPact (mbar)", "VPdef (mbar)", "sh (g/kg)",
"H2OC (mmol/mol)", "rho (g/m**3)", "wv (m/s)",
"max. wv (m/s)", "wd (deg)"]

# Этот код выведет 420 551 строку с данными (каждая строка соответствует одному замеру и содержит дату замера и 14 значений разных параметров, имеющих отно- шение к погоде), а также следующий заголовок:

# Теперь преобразуем все 420 551 строку с данными в массив Numpy.

# Листинг 6.29. Преобразование данных 

import numpy as np

float_data = np.zeros((len(lines), len(header) - 1))
for i, line in enumerate(lines):
    values = [float(x) for x in line.split(',')[1:]]
    float_data[i, :] = values
    
# Для примера построим график (рис. 6.18) изменения температуры (в градусах Цельсия). На этом графике ясно виден годовой цикл изменения температуры.


# Листинг 6.30. Создание графика изменения температуры

from matplotlib import pyplot as plt

temp = float_data[:, 1] # температура (в градусах Цельсия) plt.plot(range(len(temp)), temp)
plt.plot(range(1440), temp[:1440])


# 6 .3 .2 . Подготовка данных
# Вот точная формулировка задачи: по lookback интервалам (один интервал равен 10 минутам) за прошлый период, из которых отобраны образцы через каждые step интервалов, предсказать температуру на следующие delay интервалов. Мы будем использовать следующие значения параметров:

lookback = 720 #— количество наблюдений за предыдущие 5 дней;
step = 6 #— шаг отбора образцов из наблюдений, то есть один образец за каждый час;
delay = 144 #— целью являются следующие 24 часа в будущем.

# В процессе обработки данных мы будем вычитать среднее для каждой временной последовательности и делить на стандартное отклонение. Для обучения мы исполь- зуем первые 200 000 замеров, поэтому среднее и стандартное отклонение должны вычисляться только по этой выборке.

# Листинг 6.32. Нормализация данных

mean = float_data[:200000].mean(axis=0)
float_data -= mean
std = float_data[:200000].std(axis=0)
float_data /= std

# В листинге 6.33 показана нужная нам функция-генератор данных. Она возвращает кортеж (образцы, цели), где образцы — это один пакет входных данных, а цели — соответствующий массив целевых температур. Функция принимает следующие аргументы:
# data — исходный массив вещественных чисел, нормализованных кодом в ли- стинге 6.32;
# lookback — количество интервалов в прошлом от заданного момента, за которое отбираются входные данные;
# delay — количество интервалов в будущем от заданного момента, за которое отбираются целевые данные;
# min_index и max_index — индексы в массиве data, ограничивающие область для извлечения данных; это помогает оставить в неприкосновенности сегменты проверочных и контрольных данных;
# shuffle — флаг, определяющий порядок извлечения образцов: с перемешива- нием или в хронологическом порядке;
# batch_size — количество образцов в пакете;
# step — период в интервалах, из которого извлекается один образец; мы устано-
# вим его равным 6, чтобы получить по одному образцу за каждый час.

# Листинг 6.33. Функция-генератор, возвращающая временные последовательности образцов и их целей

def generator(data, lookback, delay, min_index, max_index, shuffle=False, batch_size=128, step=6):
    if max_index is None:
        max_index = len(data) - delay - 1
    i = min_index + lookback
    while 1:
        if shuffle:
            rows = np.random.randint(
                min_index + lookback, max_index, size=batch_size)
        else:
            if i + batch_size >= max_index:
                i = min_index + lookback
            rows = np.arange(i, min(i + batch_size, max_index))
            i += len(rows)
        samples = np.zeros((len(rows), lookback // step, data.shape[-1]))
        targets = np.zeros((len(rows),))
        for j, row in enumerate(rows):
            indices = range(rows[j] - lookback, rows[j], step)
            samples[j] = data[indices]
            targets[j] = data[rows[j] + delay][1]
        yield samples, targets
            

Теперь используем абстрактную функцию-генератор для создания трех других функций-генераторов: для получения обучающих, проверочных и контрольных данных. Все они будут отбирать образцы из разных временных сегментов ориги- нальных данных: обучающие данные будут извлекаться из первых 200 000 интер- валов, проверочные — из следующих 100 000, а контрольные — из остальных.

Листинг 6.34. Функции-генераторы, возвращающие обучающие, проверочные и контрольные данные

lookback = 1440
step = 6
delay = 144
batch_size = 128



train_gen = generator(float_data, lookback=lookback,
delay=delay, min_index=0, max_index=200000, shuffle=True, step=step, batch_size=batch_size)
val_gen = generator(float_data, lookback=lookback,delay=delay, min_index=200001, max_index=300000, step=step, batch_size=batch_size)
test_gen = generator(float_data, lookback=lookback,
delay=delay, min_index=300001, max_index=None, step=step, batch_size=batch_size)

#Сколько раз нужно обратиться к val_ gen, чтобы получить проверочный набор данных целиком
val_steps = (300000 - 200001 - lookback) // batch_size

#колько раз нужно обратиться к test_gen, чтобы получить контрольный набор данных целиком
 
test_steps = (len(float_data) - 300001 - lookback) // batch_size




# 6 .3 .3 . Базовое решение без привлечения
# машинного обучения

#  Такой классификатор будет иметь общую точность 90 %, и, соответственно, любое решение на основе машинно- го обучения должно превзойти эти 90 %, чтобы доказать свою полезность. Иногда такие элементарные базовые решения на удивление трудно превзойти.
 
#  Давайте оценим этот подход, использовав метрику средней абсолютной ошибки 
# (Mean Absolute Error, MAE):

np.mean(np.abs(preds - targets))

# Вот цикл оценки.
# Листинг 6.35. Оценка базового решения MAE





def evaluate_naive_method():
    batch_maes = []
    for step in range(val_steps):
        samples, targets = next(val_gen)
        preds = samples[:, -1, 1]
        mae = np.mean(np.abs(preds - targets))
        batch_maes.append(mae)
    print(np.mean(batch_maes))
    
evaluate_naive_method()

# Этот цикл вернул оценку MAE, равную 0,29. Так как значения температуры норма- лизованы и теперь имеют среднее значение 0 и стандартное отклонение 1, данное число нельзя интерпретировать непосредственно. Средняя абсолютная ошибка в данном случае соответствует 0,29 × temperature_std градусам Цельсия: 2,57 °C.
# Листинг 6.36. Преобразование оценки MAE в градусы Цельсия 

celsius_mae = 0.29 * std[1]

# Это довольно большая средняя абсолютная ошибка. Теперь попробуем использо-
# вать наши знания в области глубокого обучения, чтобы улучшить эту оценку.


# 6 .3 .4 . Базовое решение c привлечением машинного обучения

# Об- ратите внимание на отсутствие функции активации в последнем слое Dense, что характерно для задачи регрессии. В роли оценки потерь используется средняя абсолютная ошибка (MAE). 


# Листинг 6.37. Обучение и оценка полносвязной модели

from keras.models import Sequential
from keras import layers
from keras.optimizers import RMSprop

model = Sequential()
model.add(layers.Flatten(input_shape=(lookback // step, float_data. shape[-1])))
model.add(layers.Dense(32, activation='relu'))
model.add(layers.Dense(1))
model.compile(optimizer=RMSprop(), loss='mae')
history = model.fit_generator(train_gen,
                              steps_per_epoch=500, epochs=20,
                              validation_data=val_gen, validation_steps=val_steps)

Выведем кривые потерь на этапах обучения и проверки (рис. 6.20).
Листинг 6.38. Вывод результатов

import matplotlib.pyplot as plt
loss = history.history['loss']
val_loss = history.history['val_loss']
epochs = range(1, len(loss) + 1)
plt.figure()
plt.plot(epochs, loss, 'bo', label='Training loss') 
plt.plot(epochs, val_loss, 'b', label='Validation loss') 
plt.title('Training and validation loss')
plt.legend()
plt.show()

# 6 .3 .5 . Первое базовое рекуррентное решение
# Вместо слоя LSTM, представленного в предыдущем разделе, используем слой GRU, разработанный Чангом (Chung) с коллегами в 2014-м1. Слои управляемых рекур- рентных блоков (Gated Recurrent Unit, GRU) основаны на том же принципе, что и слои LSTM, однако они представляют собой более простые структуры и, соот- ветственно, менее затратны в вычислительном смысле (хотя могут не иметь такой же репрезентативной мощности, как LSTM). Этот компромисс между затратностью вычислений и репрезентативной мощностью можно наблюдать повсюду в области машинного обучения.


# Листинг 6.39. Обучение и оценка модели на основе GRU

from keras.models import Sequential
from keras import layers
from keras.optimizers import RMSprop

model = Sequential()
model.add(layers.GRU(32, input_shape=(None, float_data.shape[-1])))
model.add(layers.Dense(1))
model.compile(optimizer=RMSprop(), loss='mae')
history = model.fit_generator(train_gen,
steps_per_epoch=500, epochs=20, validation_data=val_gen, validation_steps=val_steps)


# 6 .3 .6 . Использование рекуррентного прореживания для борьбы с переобучением

# ны обнуляться одни и те же значения) и не из- меняться от интервала к интервалу. Более того, для регуляризации представлений, сформированных рекуррентными слоями, такими как GRU и LSTM, временно-по- стоянная маска прореживания должна применяться к внутренним рекуррентным активациям слоя (рекуррентная маска прореживания). Применение той же маски прореживания к каждому интервалу времени позволяет сети правильно распро- странить свою ошибку обучения во времени; временно-случайная маска нарушит этот сигнал ошибки и навредит процессу обучения

# Keras. Каждый рекуррентный слой в Keras обладает двумя аргументами, имеющими отношение к прореживанию: dropout, вещественным числом, определяющим долю прореживаемых входных значений слоя, и recurrent_dropout, определяющим долю прореживаемых рекур- рентных значений.

# Поскольку сети, регуляризованные с применением прореживания, всегда требуют больше времени для полной сходимости, обучим сеть за количество эпох в два раза большее.



# Листинг 6.40. Обучение и оценка модели на основе GRU с регуляризацией прореживанием

from keras.models import Sequential
from keras import layers
from keras.optimizers import RMSprop

model = Sequential()
model.add(layers.GRU(32, dropout=0.2,recurrent_dropout=0.2, input_shape=(None, float_data.shape[-1])))

model.add(layers.Dense(1))
model.compile(optimizer=RMSprop(), loss='mae')

history = model.fit(train_gen,
steps_per_epoch=500, epochs=40, validation_data=val_gen, validation_steps=val_steps)


6 .3 .7 . Наложение нескольких рекуррентных слоев
друг на друга

# LSTM — это огромная сеть.
# При наложении друг на друга рекуррентных слоев в Keras все промежуточные слои должны возвращать полные выходные последовательности (трехмерный тензор), а не только последний интервал. Это достигается установкой параметра return_sequences=True.


# Листинг 6.41. Обучение и оценка модели с несколькими слоями GRU и с регуляризацией прореживанием

from keras.models import Sequential
from keras import layers
from keras.optimizers import RMSprop

model = Sequential()
model.add(layers.GRU(32,dropout=0.1,recurrent_dropout=0.5, return_sequences=True,
input_shape=(None, float_data.shape[-1])))

model.add(layers.GRU(64, activation='relu', dropout=0.1,
recurrent_dropout=0.5)) 
model.add(layers.Dense(1))

model.compile(optimizer=RMSprop(), loss='mae')

history = model.fit(train_gen,
steps_per_epoch=500, epochs=40, validation_data=val_gen, validation_steps=val_steps)

# Результаты показаны на рис. 6.23. Как видите, дополнительный слой немного улучшил результаты, хотя и незначительно. Отсюда можно сделать два вывода:
    
# Поскольку проблема переобучения все еще не стоит остро, можно продолжить увеличивать размеры слоев в попытках улучшить оценку потерь на этапе проверки. Однако это сопряжено с немалыми затратами вычислительных ресурсов.

# Добавление слоя не привело к существенному улучшению, то есть в данном случае наблюдается уменьшение отдачи от увеличения емкости сети.

**********************************************************************
**********************************************************************
# 6 .3 .8 . Использование двунаправленных рекуррентных нейронных сетей
**********************************************************************
**********************************************************************

# Последнее средство, которое мы рассмотрим в этом разделе, называется двуна- правленные рекуррентные нейронные сети (bidirectional RNN). Двунаправлен- ная рекуррентная сеть — распространенная разновидность рекуррентных сетей, способная обеспечить более высокое качество решения некоторых задач. Она часто используется в обработке естественного языка — ее можно даже назвать швейцарским армейским ножом глубокого обучения для обработки естествен- ного языка.



# Давайте попробуем применить тот же прием к примеру анализа данных из IMDB со слоем LSTM из раздела 6.2.

# Листинг 6.42. Обучение и оценка LSTM на обращенных последовательностях

from keras.datasets import imdb
from keras.preprocessing import sequence 
from keras import layers
from keras.models import Sequential

max_features = 10000
maxlen = 500

(x_train, y_train), (x_test, y_test) = imdb.load_data( num_words=max_features)
x_train = [x[::-1] for x in x_train]
x_test = [x[::-1] for x in x_test]

x_train = sequence.pad_sequences(x_train, maxlen=maxlen)
x_test = sequence.pad_sequences(x_test, maxlen=maxlen)

model = Sequential()
model.add(layers.Embedding(max_features, 128))
model.add(layers.LSTM(32))
model.add(layers.Dense(1, activation='sigmoid'))


model.compile(optimizer='rmsprop', loss='binary_crossentropy',
metrics=['acc'])
history = model.fit(x_train, y_train,
epochs=10, batch_size=128, validation_split=0.2)

# Для создания двунаправленной рекуррентной сети в Keras имеется слой Bidi- rectional, который в своем первом аргументе принимает экземпляр рекуррентного слоя. Слой Bidirectional создает второй, отдельный экземпляр этого рекуррентно- го слоя и использует один экземпляр для обработки входных последовательностей в прямом порядке, а другой — в обратном. Давайте опробуем этот прием на задаче анализа эмоциональной окраски отзывов в наборе данных IMDB.

# Листинг 6.43. Обучение и оценка двунаправленной модели LSTM

model = Sequential()
model.add(layers.Embedding(max_features, 32))
model.add(layers.Bidirectional(layers.LSTM(32)))
model.add(layers.Dense(1, activation='sigmoid'))
model.compile(optimizer='rmsprop', loss='binary_crossentropy', metrics=['acc'])

history = model.fit(x_train, y_train, epochs=10, batch_size=128, validation_split=0.2)

# Результаты немного улучшились в сравнении с обычной моделью LSTM, которую мы опробовали в предыдущем разделе. Оценка точности на этапе проверки пре- высила 89 %. Кроме того, похоже, что эта модель быстрее достигает состояния переобучения, что неудивительно, потому что двунаправленный слой имеет в два раза больше параметров по сравнению с однонаправленным слоем LSTM. 

# применив некоторую регуляризацию, мы наверняка смогли бы улучшить качество
# этой модели.
# Теперь попробуем применить этот же подход к задаче прогнозирования темпера- туры


# Листинг 6.44. Обучение двунаправленной модели GRU

from keras.models import Sequential
from keras import layers
from keras.optimizers import RMSprop

model = Sequential()
model.add(layers.Bidirectional(
layers.GRU(32), input_shape=(None, float_data.shape[-1])))
model.add(layers.Dense(1))
model.compile(optimizer=RMSprop(), loss='mae')
history = model.fit_generator(train_gen,
steps_per_epoch=500, epochs=40, validation_data=val_gen, validation_steps=val_steps)


# Качество этой модели ничуть не улучшилось по сравнению с обычным слоем GRU. Легко понять почему: все прогностические способности исходят из половины сети, обрабатывающей данные в прямом хронологическом порядке, потому что, как мы уже выяснили, качество половины, обрабатывающей данные в обратном порядке, сильно отстает в этой задаче (потому что в данном случае недавнее прошлое имеет большее значение, чем отдаленное).



# 6 .3 .9 . Что дальше
# Существует множество других приемов, которые можно было бы попробовать при- менить, чтобы улучшить качество прогнозирования температуры:
# Изменить количество параметров в каждом рекуррентном слое в конфигурации с несколькими слоями. Текущий выбор был сделан практически произвольно и поэтому наверняка не является оптимальным.
# Изменить скорость обучения с помощью оптимизатора RMSprop.
# Попробовать использовать слои LSTM вместо GRU.
# Попробовать использовать больший полносвязный регрессор поверх рекур- рентных слоев, то есть больший слой Dense или даже несколько слоев Dense.
# Не забудьте, наконец, опробовать лучшие модели (с точки зрения средней абсолютной ошибки) на контрольном наборе! Иначе у вас будут получаться архитектуры, переобученные на проверочном наборе.

# 6 .3 .10 . Подведение итогов
# Вот какие выводы вы должны сделать из всего, что узнали в этом разделе:
# Как мы впервые узнали в главе 4, приступая к решению новой задачи, всегда желательно получить базовое решение, опираясь на метрики по вашему выбору. Если у вас не будет такого базового решения, на которое можно ориентировать- ся, вы не сможете сказать, движетесь ли вы в правильном направлении.
# Пробуйте сначала создавать простые модели, чтобы убедиться в необходимости приложения дополнительных усилий. Иногда простая модель может оказаться лучшим решением.
# Для обработки данных, в которых порядок следования имеет значение, лучше всего подходят рекуррентные сети — они с легкостью превосходят модели, ко- торые сначала снижают размерность исходных данных.
# Применяя прием прореживания с рекуррентными сетями, использyйте вре- менно-постоянные и рекуррентные маски прореживания. В Keras уже имеются встроенные рекуррентные слои, поэтому вам останется только определить их аргументы dropout и recurrent_dropout.
# Комбинацииизнесколькихрекуррентныхслоевобеспечиваютбо льшуюрепре- зентативность, чем один слой. Они также являются намного более затратными с точки зрения вычислений, и поэтому их применение не всегда оправданно. Они позволяют повысить качество решения сложных задач (таких, как машин- ный перевод), но не всегда подходят для небольших и простых задач.
# Двунаправленные рекуррентные сети, просматривающие последователь- ность данных в обоих направлениях, дают хорошие результаты в задачах об- работки естественного языка. Но они мало пригодны для обработки последо- вательностей, в которых недавние данные информативнее, чем находящиеся в начале.



# ПРИМЕЧАНИЕ
# Существует еще два важных понятия, которые мы не будем подробно обсуждать здесь: рекуррентные модели с механизмом внимания (recurrent attention) и маски- ровка последовательностей (sequence masking). Оба способа хорошо подходят для обработки естественного языка и плохо — для прогнозирования температуры. Мы оставляем их вам для самостоятельного изучения.