
# 7 .1 .4 . Ориентированные ациклические графы уровней

# Фреймворк Keras позволяет создавать нейронные сети, организован- ные как произвольные ориентированные ациклические графы слоев. Уточнение ациклические очень важно: такие графы не имеют замкнутых маршрутов. Тензор x не может служить входом в один из слоев, генерирующих x. Единственными до- пустимыми циклами обработки (то есть рекуррентными связями) являются циклы внутри рекуррентных слоев


# Модули Inception
# Под названием Inception подразумевается популярная архитектура сверточных нейронных сетей;

# НАЗНАЧЕНИЕ СВЕРТОК 1 × 1

# Вот как можно реализовать модуль, изображенный на рис. 7.8, с помощью функ- ционального API. Этот пример предполагает наличие четырехмерного входного тензора x:


# branch_a Все ветви имеют одинаковый шаг свертки (2). Это необходимо для получения на выходе всех ветвей тензоров одного размера, чтобы потом их можно было объединить
# branch_b В этой ветви шагание происходит в слое пространственной свертки
# branch_c В этой ветви шагание происходит в слое извлечения среднего по соседям


# output Объединение результатов, возвращаемых ветвями для получения результата работы модуля
from keras import layers 


branch_a = layers.Conv2D(128, 1, activation='relu', strides=2)(x)
branch_b = layers.Conv2D(128, 1, activation='relu')(x)
branch_b = layers.Conv2D(128, 3, activation='relu', strides=2)(branch_b)

branch_c = layers.AveragePooling2D(3, strides=2)(x)
branch_c = layers.Conv2D(128, 3, activation='relu')(branch_c)

branch_d = layers.Conv2D(128, 1, activation='relu')(x)
branch_d = layers.Conv2D(128, 3, activation='relu')(branch_d)
branch_d = layers.Conv2D(128, 3, activation='relu', strides=2)(branch_d)

output = layers.concatenate(
[branch_a, branch_b, branch_c, branch_d], axis=-1)

# Обратите внимание на то, что полная архитектура Inception V3 доступна в Keras как keras.applications .inception_v3.InceptionV3, включая веса, полученные предварительным обучением на наборе данных ImageNet
# Xception имеет примерно такое же число параметров, как Inception V3, но показывает более высокую скорость работы и точность на наборе ImageNet, а также на других больших наборах данных благодаря более эффективному ис- пользованию параметров модели

# Остаточные связи
# Остаточные связи — это распространенный графоподобный компонент сети, который можно встретить во многих архитектурах сетей, разработанных после 2015 года, включая Xception
# В общем случае добавление остаточных связей в любую модель, имеющую более 10 слоев, почти наверняка даст положительный результат.


# Вот как можно реализовать остаточную связь в Keras, когда размеры карт при- знаков совпадают. Этот пример предполагает наличие четырехмерного входного тензора x:

x = ...

y = layers.Conv2D(128,3, activation='relu', padding='same')(x) # применение преобразования к х
y = layers.Conv2D(128,3, activation='relu', padding='same')(y)
y = layers.Conv2D(128,3, activation='relu', padding='same')(y)

y = layers.add([y, x]) # add original tensor x to output signs 

# А вот так реализуется остаточная связь, когда размеры карт признаков различаются (и снова предполагается наличие четырехмерного входного тензора x)

#residual-  Используется свертка 1 × 1 для линейного снижения размерности исходного тензора x, чтобы получить форму как у тензора y

from keras import layers

x = ... 

y = layers.Conv2D(128,3, activation='relu', padding='same')(x) # применение преобразования к х
y = layers.Conv2D(128,3, activation='relu', padding='same')(y)
y = layers.MaxPooling2D(2, strides=2)(y)


residual = layers.Conv2D(128, 1, strides=2, padding='same')(x)

y = layers.add([y, residual]) # Добавление остаточного тензора к выходным признакам

# ЗАТУХАНИЕ ГРАДИЕНТА В ГЛУБОКОМ ОБУЧЕНИИ
# Алгоритм обратного распространения ошибки — основной алгоритм, используемый для обучения глубоких нейронных сетей, — основан на распространении сигнала обратной связи от вывода к ранним слоям . Если сигналу приходится распространяться через глу- бокий стек слоев, он может ослабнуть или даже полностью потеряться, что сделает сеть необучаемой . Эта проблема известна как затухание градиентов .

# 7 .1 .5 . Повторное использование экземпляров слоев

# Вот как можно реализовать такую модель с использованием приема совместно- го (или повторного) использования слоя в функциональном API фреймворка Keras:


from keras import layers
from keras import Input
from keras.models import Model

# Создание единственного экземпляра слоя LSTM, выполняется однократно
lstm = layers.LSTM(32)

#Конструирование левой ветви модели: на вход подаются последовательности переменной
# длины векторовс размерностью 128


left_input = Input(shape=(None, 128))
left_output = lstm(left_input)

right_input = Input(shape=(None, 128))
right_output = lstm(right_input)

# Добавление классификатора сверху
merged = layers.concatenate([left_output, right_output], axis=-1)
predictions = layers.Dense(1, activation='sigmoid')(merged)

# Создание и обучение модели: в процессе обучения такой модели веса слоя LSTM обновляются в процессе обработки обоих входов
model = Model([left_input, right_input], predictions)
model.fit([left_data, right_data], targets)


# 7 .1 .6 . Модели как слои
# Важно отметить, что функциональный API позволяет использовать модели как слои — фактически о моделях можно думать как о «больших слоях». Это верно для обоих классов — Sequential и Model. Другими словами, можно вызвать модель, передав ей входной тензор, и получить выходной тензор:

y = model(x)

# Если модель принимает несколько входных тензоров и возвращает несколько вы- ходных тензоров, ее следует вызывать со списками тензоров:

y1, y2 = model([x1, x2])


# Простым примером практического применения повторного использования экзем- пляра модели может служить модель зрения, которая в качестве входа использует сдвоенную камеру: две параллельные камеры, отстоящие друг от друга на пару сантиметров (один дюйм)
# Вот как можно реализовать сиамскую модель зрения (с общей сверточной основой) в Keras:


from keras import layers 
from keras import applications  
from keras import Input 

# Базовая модель обработки #изображения — сеть Xception # (только сверточная основа)


xception_base = applications.Xception(weights=None, include_top=False)

# На вход подаются изображенияв формате RGB и с размером 250 × 250

left_input = Input(shape=(250, 250, 3))
right_input = Input(shape=(250, 250, 3))

# Одна и та же модель вызывается дважды

left_features = xception_base(left_input) 
right_input = xception_base(right_input)

# Объединенный набор признаков содержит информацию из правого и левого источников визуальной информации

merged_features = layers.concatenate( [left_features, right_input], axis=-1)




# 7 .1 .7 . Подведение итогов
# На вход подаются изображения
# в формате RGB и с размером 250 × 250
# Одна и та же модель вызывается дважды
# Объединенный набор признаков содержит информацию из правого и левого источников визуальной информации
#  На этом мы завершаем введение в функциональный API фреймворка Keras — основной инструмент для создания глубоких нейронных сетей с продвинутыми архитектурами. Теперь вы знаете:
# что можно использовать помимо Sequential API, когда потребуется нечто более мощное, чем линейный стек слоев;
# как средствами функционального API фреймворка Keras создавать модели с не- сколькими входами, несколькими выходами и сложной внутренней топологией;
# как повторно использовать экземпляры слоев или моделей в разных обрабаты- вающих ветвях, вызывая один и тот же экземпляр слоя или модели несколько раз