# 7 .3 . Извлечение максимальной пользы
# из моделей



# 7 .3 .1 . Шаблоны улучшенных архитектур
# В предыдущем разделе мы рассмотрели один из важнейших шаблонов проектиро- вания: остаточные связи. Однако есть еще два шаблона, которые вы должны знать: нормализация и раздельные свертки по глубине (depthwise separable convolution). Эти шаблоны особенно хорошо подходят для создания высококачественных глу- боких сверточных нейронных сетей, но их нередко можно встретить во многих других типах архитектур.


# Пакетная нормализация
# Нормализация — это широкая категория методов, стремящихся сделать сходство разных образцов более заметным для модели машинного обучения, что помогает модели выделять и обобщать новые данные.


normalized_data = (data - np.mean(data, axis=...)) / np.std(data, axis=...)


# В предыдущих примерах нормализация выполнялась перед передачей данных в мо- дели. Однако нормализация должна проводиться после каждого преобразования, выполняемого сетью: даже если данные на входе в сеть Dense или Conv2D имеют среднее значение 0 и единичную дисперсию, нет оснований полагать, что то же самое можно будет сказать в отношении данных на выходе.



# Обычно слой BatchNormalization используется после сверточного или полно- связного слоя:
    
conv_model.add(layers.Conv2D(32, 3, activation='relu'))
conv_model.add(layers.BatchNormalization())  # После слоя Conv 
dense_model.add(layers.Dense(32, activation='relu'))
dense_model.add(layers.BatchNormalization())  # После слоя dense 


# Слой BatchNormalization принимает аргумент axis, определяющий ось призна- ков для нормализации. По умолчанию этот аргумент принимает значение –1,



# Эти преимущества особенно важны для обучения небольших моделей с нуля на ограниченном наборе данных. Например, вот как можно построить легковесную нейронную сеть со сверткой по глубине для решения задачи классификации изо- бражений (с применением классификатора softmax) при небольшом объеме обу- чающих данных:


from keras.models import Sequential, Model
from keras import layers

height = 64 
width = 64
channels = 3

num_classes = 10

model = Sequential()

model.add(layers.SeparableConv2D(32, 3,
activation='relu',
input_shape=(height, width, channels,)))


model.add(layers.SeparableConv2D(64, 3, activation='relu'))
model.add(layers.MaxPooling2D(2))

model.add(layers.SeparableConv2D(64, 3, activation='relu'))
model.add(layers.SeparableConv2D(128, 3, activation='relu'))
model.add(layers.MaxPooling2D(2))

model.add(layers.SeparableConv2D(64, 3, activation='relu'))
model.add(layers.SeparableConv2D(128, 3, activation='relu')) 

model.add(layers.GlobalAveragePooling2D())
model.add(layers.Dense(32, activation='relu')) 

model.add(layers.Dense(num_classes, activation='softmax'))
model.compile(optimizer='rmsprop', loss='categorical_crossentropy')


# В отношении крупных моделей раздельные свертки по глубине составляют основу архитектуры Xception высококачественных сверточных нейронных сетей, входя- щей в состав Keras.


# 7 .3 .2 . Оптимизация гиперпараметров


# 7 .3 .2 . Оптимизация гиперпараметров
# При создании модели глубокого обучения приходится принимать множество решений, кажущихся произвольными: сколько слоев включить в стек? сколько параметров или фильтров должно быть в каждом слое? использовать ли функцию активации relu или какую-то другую? использовать ли BatchNormalization после данного слоя? какой шаг прореживания выбрать? И так далее. Все эти архитек- турные параметры называют гиперпараметрами, чтобы отличать их от параметров модели, которые обучаются посредством обратного распространения ошибки.



# Однако перебор разных пара- метров не должен быть вашей основной работой — это дело лучше доверить машине.
# Другими словами, вам нужно автоматически, систематически и принципиально ис- следовать пространство возможных решений. Вам нужно эмпирически исследовать пространство архитектур и найти ту из них, которая сможет обеспечить лучшее ка- чество. Именно эту задачу решает автоматическая оптимизация гиперпараметров: это огромная и очень важная область исследований.


# Вот как выглядит типичный процесс оптимизации гиперпараметров:
# 1. Выбрать набор гиперпараметров (автоматически).
# 2. Создать соответствующую модель.
# 3. Обучить ее на обучающих данных и оценить качество на проверочных данных.
# 4. Выбрать следующий набор гиперпараметров (автоматически).
# 5. Повторить.
# 6. Получить окончательную оценку качества на контрольных данных.



# Проблемы сложны, а область еще молода, поэтому в настоящее время в нашем распоряжении имеется весьма ограниченный набор инструментов для оптимиза- ции моделей. Часто случайный поиск (многократный выбор случайных значений гиперпараметров) оказывается лучшим решением, несмотря на то что он самый простой. Однако я обнаружил один инструмент, который достоверно лучше слу- чайного поиска, — Hyperopt (https://github.com/hyperopt/hyperopt), библиотеку на Python для оптимизации гиперпараметров: внутренне она использует деревья оценок Парзена для предсказания наборов гиперпараметров, которые с высокой вероятностью дадут положительный результат. Еще одна библиотека, с названием Hyperas (https://github.com/maxpumperla/hyperas), интегрирует Hyperopt для ис- пользования с моделями Keras. Обязательно обратите на нее внимание.



# ПРИМЕЧАНИЕ
# При использовании автоматического оптимизатора гиперпараметров важно пом- нить об одной важной проблеме — переобучении на проверочном наборе. Посколь- ку настройка гиперпараметров выполняется по результатам оценки на проверочных данных, фактически происходит их обучение на проверочном наборе, и, как след- ствие, быстро наступает эффект их переобучения. Всегда помните об этом.



# В целом оптимизация гиперпараметров — мощный метод, абсолютно необходимый в любых задачах для создания моделей, способных победить в состязаниях по ма- шинному обучению. Когда-то люди вручную выбирали признаки, которые затем передавались в поверхностные модели машинного обучения. Этот подход был очень неоптимален. Теперь глубокое обучение автоматизирует конструирование



# 7 .3 .3 . Ансамблирование моделей
# Еще один метод улучшения результатов в решении задач — ансамблирование моделей. Суть метода ансамблирования заключается в объединении прогнозов, полученных набором разных моделей, для получения лучшего прогноза. Если рассмотреть результаты соревнований по машинному обучению, например, на сайте Kaggle, можно увидеть, что победители используют очень большие ан- самбли моделей, которые неизменно побеждают любые одиночные модели, даже самые лучшие.


# Возьмем в качестве примера задачу классификации. Самый простой способ объ- единить прогнозы из множества классификаторов (ансамблировать классифика- торы) — получить среднее их прогнозов на этапе вывода:
    
preds_a = model_a.predict(x_val)
preds_b = model_b.predict(x_val) # Применение четырех разных моделей
preds_c = model_c.predict(x_val)
preds_d = model_d.predict(x_val)
 
final_preds = 0.25 * (preds_a + preds_b + preds_c + preds_d)

# Этот новый массив прогнозов должен получиться более точным, чем любой из начальных



# Более эффективный способ ансамблирования классификаторов — вычисление взвешенного среднего с определением весов по проверочным данным, когда луч- ший классификатор получает больший вес, а худший — меньший. Для поиска оптимальных весов в ансамбле можно использовать алгоритм случайного поиска или простой оптимизации, такой как Nelder-Mead:
    
    
preds_a = model_a.predict(x_val)
preds_b = model_b.predict(x_val)
preds_c = model_c.predict(x_val)
preds_d = model_d.predict(x_val)

# Эти веса (0.5, 0.25, 0.1, 0.15), как предполагается, получены эмпирическим путем
final_preds = 0.5 * preds_a + 0.25 * preds_b + 0.1 * preds_c + 0.15 * preds_d



# 7 .3 .4 . Подведение итогов
# Для создания высококачественных глубоких сверточных нейронных сетей вам понадобятся остаточные связи, пакетная нормализация и раздельные свертки по глубине. В будущем вполне возможно, что раздельные свертки по глубине полностью вытеснят обычные свертки в одно-, двух- и трехмерных применениях благодаря их высокой эффективности.
# При создании глубоких сетей часто приходится подбирать гиперпараметры и архитектуры, которые вместе определяют качество вашей модели. Вместо того чтобы основывать выбор на интуиции или случайных вариантах, намного лучше организовать систематический поиск в пространстве гиперпараметров, чтобы найти оптимальный вариант. На данный момент этот процесс очень за- тратный, а инструменты не очень хороши. Однако вам на помощь могут прийти библиотеки Hyperopt и Hyperas. Оптимизируя гиперпараметры, не забывайте о переобучении на поверочном наборе!
# Одержать победу в соревнованиях по машинному обучению и вообще получить максимально хорошие результаты в решении задач можно только с исполь- зованием больших ансамблей моделей. Ансамблирование с использованием взвешенного среднего обычно дает неплохие результаты. Однако помните: сила в разнообразии. Бессмысленно ансамблировать схожие модели; лучшие ансамб- ли получаются из максимально разнородных моделей (при этом, естественно, имеющих максимальную прогнозирующую способность).


# Краткие итоги главы
# В этой главе вы узнали:
# y как конструировать модели в виде произвольного графа слоев, повторно использовать слои (веса слоев) и использовать модели подобно функциям Python (как шаблоны моделей);
# y как использовать обратные вызовы Keras для наблюдения за состоянием модели в ходе обучения и выполнении действий в зависимости от этого со- стояния;
# y как с помощью TensorBoard визуализировать метрики, гистограммы актива- ций и даже пространства векторных представлений;
# y что такое пакетная нормализация, раздельная свертка по глубине и остаточ- ные связи;
# y почему необходимо использовать оптимизацию параметров и ансамблиро- вание моделей.
# Получив эти новые инструменты, вы теперь лучше готовы к практическому применению глубокого обучения и сможете создавать конкурентоспособные модели глубокого обучения.