# 7 .2 . Исследование и мониторинг моделей глубокого обучения с использованием обратных вызовов Keras и TensorBoard

# Приемы, которые будут представлены здесь, превратят вызов model.fit() из бумажного самолетика в ин- теллектуальный автономный беспилотник, способный оценивать свое состояние и своевременно выполнять управляющие воздействия.


# 7 .2 .1 . Применение обратных вызовов для воздействия на модель в ходе обучения

# Гораздо лучше было бы остановить обучение, как только выяснится, что оценка потерь на проверочном наборе перестала улучшаться. Это можно реализовать с использованием механизма обратных вызовов в Keras. Обратный вызов — это объект (экземпляр класса, реализующего конкретные методы), который передается в модель через вызов fit и который будет вызываться моделью в разные моменты в процессе обучения. Он имеет доступ ко всей информации о состоянии модели и ее качестве и может предпринимать следующие действия: прерывать обучение, сохранять модели, загружать разные наборы весов или как-то иначе изменять со- стояние модели.


# Вот несколько примеров использования обратных вызовов:
# фиксация состояния модели в контрольных точках — сохранение текущих весов модели в разные моменты в ходе обучения;
# ранняя остановка — прерывание обучения, когда оценка потерь на провероч- ных данных перестает улучшаться (и, конечно, сохранение лучшего варианта модели, полученного в ходе обучения);
# динамическая корректировка значений некоторых параметров в процессе обу- чения, например шага обучения оптимизатора;
# журналирование оценок для обучающего и проверочного наборов данных в ходе обучения или визуализация представлений, получаемых моделью, по мере их обновления — индикатор выполнения в Keras, с которым вы уже знакомы, — обратный вызов!


# Модуль  keras.callbacks 

# включает в себя ряд встроенных обратных вызовов.

# Вот далеко не полный список:


keras.callbacks.ModelCheckpoint
keras.callbacks.EarlyStopping
keras.callbacks.LearningRateScheduler
keras.callbacks.ReduceLROnPlateau
keras.callbacks.CSVLogger


# Обратные вызовы ModelCheckpoint и EarlyStopping

# Обратный вызов EarlyStopping можно использовать для прерывания процесса обучения, если находящаяся под наблюдением целевая метрика не улучшалась на протяжении заданного количества эпох.

# Этот обратный вызов обычно используется в комбинации с ModelCheckpoint, который позволяет сохранять состояние модели в ходе обучения (и, при необходимости, сохранять только лучшую модель: версию модели, достигшую лучшего качества к концу эпохи):

#  callbacks_list - Передача обратных вызовов в модель через аргумент callbacks метода fit в виде списка. Вы можете передать любое количество обратных вызовов


callbacks_list = [ 
                  keras.callbacks.EarlyStopping(monitor='val_acc',patience=1, ),
                  
                  keras.callbacks.ModelCheckpoint( filepath='my_model.h5', monitor='val_loss', save_best_only=True,)
                  ]

model.compile(optimizer='rmsprop',
              loss='binary_crossentropy',metrics=['acc'])


model.fit(x, y, epochs=10, batch_size=32,
          callbacks=callbacks_list, validation_data=(x_val, y_val))



# Обратный вызов ReduceLROnPlateau



# Этот обратный вызов можно использовать для снижения скорости обучения, когда потери на проверочных данных перестают уменьшаться. Уменьшение или увеличение скорости обучения в точке перегиба кривой потерь — эффективная стратегия выхода из локального минимума в ходе обучения. Следующий пример демонстрирует применение обратного вызова ReduceLROnPlateau


callbacks_list = [ 
                  keras.callbacks.ReduceLROnPlateau(
                  monitor='val_loss', # Мониторинг потерь модели на проверочных данных
                  factor=0.1, # Уменьшение скорости обучения в 10 раз
                  patience=10,)  # Произведение вызова, когда потери на проверочных данных не улучшаются в течение 10 эпох
                  ]


# Поскольку обратный вызов следит за потерями на проверочных данных, мы должны передать validation_data в вызов fit

model.fit(x, y, epochs=10,
batch_size=32, callbacks=callbacks_list, validation_data=(x_val, y_val))


# Разработка своего обратного вызова

# Если в ходе обучения потребуется выполнить какие-то особые действия, не преду- смотренные ни одним из встроенных обратных вызовов, можно написать свой обратный вызов. Обратные вызовы реализуются путем наследования класса keras.callbacks.Callback. Вы можете реализовать любые из следующих методов с говорящими именами, которые будут вызываться в соответствующие моменты в ходе обучения


on_epoch_begin # Вызывается в начале каждой эпохи
on_epoch_end  #  Вызывается в конце каждой эпохи
on_batch_begin # Вызывается перед началом обработки каждого пакета
on_batch_end # Вызывается сразу после окончания обработки каждого пакета
on_train_begin # Вызывается в начале обучения
 
on_train_end # Вызывается в конце обучения

 Все эти методы вызываются с аргументом logs — словарем, содержащим ин- формацию о предыдущем пакете, эпохе или цикле обучения: метрики обучения и проверки и т. д. Кроме того, обратный вызов имеет доступ к следующим атри- бутам:
     
self.model — экземпляр модели, вызвавшей этот обратный вызов;
self.validation_data — значение, переданное методу fit в качестве провероч- ных данных
     
     
     
# Вот простой пример нестандартного обратного вызова, который сохраняет на диск (как массивы Numpy) активации всех слоев модели после окончания каждой эпохи, вычисленные по первому образцу в проверочном наборе

import keras
import numpy as np

class ActivationLogger(keras.callbaks.Callback):
    #self.model Вызывается родительской моделью перед обучением, чтобы сообщить обратному вызову, какая модель будет обращаться к нему
    def set_model(self, model):
        self.model = model
        layer_outputs = [layer.output for layer in model.layers] 
        #Экземпляр модели, которая будет возвращать активации для всех слоев
        self.activations_model = keras.models.Model(model.input,
                                                    layer_outputs)
    def on_epoch_end(self, epoch, logs=None):
        if self.validation_data is None:
            raise RuntimeError('Requires validation_data.')
        # Получение первого образца 
        validation_sample = self.validation_data[0][0:1]
        activations = self.activations_model.predict(validation_sample)
        # Сохранение массива на диск из проверочных данных
        f = open('activations_at_epoch_' + str(epoch) + '.npz', 'wb')
        np.savez(f, activations)
        f.close()
        
        

# Это все, что нужно знать об обратных вызовах, все остальное — технические детали, информацию о которых вы легко сможете отыскать самостоятельно. Теперь вы смо- жете выполнять журналирование любой информации или оказывать управляющие воздействия на модель Keras в ходе обучения